
SKILL["state_hoi_sinh_luc"] = {
	["phục_hồi_sinh_lực_mỗi_nửa_giây"] = 
	{
		{
			{1,10},
			{2,25},
			{3,25},
			{4,50},
			{5,500},
		},
		{{1,100},{2,100}}
	},
}

SKILL["state_hoi_noi_luc"] = {
	["phục_hồi_nội_lực_mỗi_nửa_giây"] = 
	{
		{
			{1,5},
			{2,10},
			{3,20},
			{4,50},
			{5,500},
		},
		{{1,100},{2,100}}
	},
}

SKILL["state_hoi_sinh_luc_noi_luc"] = {
	["phục_hồi_sinh_lực_mỗi_nửa_giây"] = 
	{
		{
			{1,10},
			{2,25},
			{3,25},
			{4,50},
			{5,500},
		},
		{{1,100},{2,100}}
	},
	["phục_hồi_nội_lực_mỗi_nửa_giây"] = 
	{
		{
			{1,6},
			{2,10},
			{3,20},
			{4,50},
			{5,500},
		},
		{{1,100},{2,100}}
	},
}



