
SKILL["tong_kim_ho_tro_chien_co"] = {
	["sinh_lực_tối_đa_phần_trăm"]  = {
		{{1,30},{20,30}}, 
		{{1,3*60*18},{20,3*60*18}}
	},
	["phòng_thủ_vật_lý_phần_trăm"] = {
		{{1,30},{20,30}}, 
		{{1,3*60*18},{20,3*60*18}}
	},
}

SKILL["tong_kim_ho_tro_lenh_bai"] = {
	["tốc_độ_di_chuyển_phần_trăm"] = {{{1,30},{20,30}}, {{1,3*60*18},{20,3*60*18}}},
	["tốc_độ_đánh_nội_phần_trăm"] = {{{1,50},{20,50}}, {{1,3*60*18},{20,3*60*18}}},
	["tốc_độ_đánh_ngoại_phần_trăm"] = {{{1,50},{20,50}}, {{1,3*60*18},{20,3*60*18}}},
}
