
SKILL["mizhong_huanying"] = {
	["tên_kỹ_năng"] = "Mê Tung ảo ảnh",
	["thời_gian_làm_chậm_phần_trăm"]={{{1,-5},{20,-50}},{{1,18*45},{20,18*120}}},
	["thời_gian_choáng_phần_trăm"]={{{1,-5},{20,-50}},{{1,18*45},{20,18*120}}},
	["tiêu_hao_nội_lực"]={{{1,30},{20,40}}}
}

SKILL["kunlun_daofa"] = {
	["tên_kỹ_năng"] = "Côn Lôn Đao pháp",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,35},{20,215}},{{1,-1},{2,-1}},{{1,1},{2,1}}},
	["tăng_tấn_công_chí_mạng_phần_trăm"]={{{1,6},{20,50,Conic}},{{1,-1},{2,-1}}}
}

SKILL["kunlun_jianfa"] = {
	["tên_kỹ_năng"] = "Côn Lôn Kiếm pháp",
	["lôi_sát_nội"]={{{1,19},{20,215}},{{1,-1},{2,-1}}}
}

SKILL["hufeng_fa"] = {
	["tên_kỹ_năng"] = "Hô Phong Pháp",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,5},{20,75}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,1},{20,10}}},
	["lôi_sát_ngoại_trong_khoảng"]={
		[1]={{1,15},{20,180}},
		[3]={{1,15},{20,180}}
	},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,372},{2,372}},
		[3]={{1,1},{20,100}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,176},{2,176}},
		[3]={{1,1},{20,35}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,20},{20,24}}},
	["phạm_vi_hiệu_quả"]={{{1,320},{20,384}}},
	["tiêu_hao_nội_lực"]={{{1,15},{20,15}}}
}

SKILL["qingfeng_fu"] = {
	["tên_kỹ_năng"] = "Thanh Phong phù",
	["tốc_độ_di_chuyển_phần_trăm"]={{{1,22},{20,60}},{{1,18*120},{20,18*120}}},
	["tiêu_hao_nội_lực"]={{{1,40},{20,40}}}
}

SKILL["tianji_xunlei"] = {
	["tên_kỹ_năng"] = "Thiên Tế Tấn Lôi",
	["lôi_sát_nội_trong_khoảng"]={
		[1]={{1,25},{20,550}},
		[3]={{1,25},{20,550}}
	},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,375},{2,375}},
		[3]={{1,1},{20,65}}
	},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,1},{20,30}}},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,24},{20,28}}},
	["phạm_vi_hiệu_quả"]={{{1,384},{20,448}}},
	["tiêu_hao_nội_lực"]={{{1,15},{20,35}}}
}

SKILL["tianqing_dizhuo"] = {
	["tên_kỹ_năng"] = "Thiên Thanh Địa Trọc",
	["kháng_lôi_phần_trăm"]={{{1,13},{20,32}},{{1,18*120},{20,18*120}}},
	["kháng_hỏa_phần_trăm"]={{{1,9},{20,28}},{{1,18*120},{20,18*120}}},
	["kháng_băng_phần_trăm"]={{{1,13},{20,32}},{{1,18*120},{20,18*120}}},
	["phòng_thủ_vật_lý_phần_trăm"]={{{1,9},{20,28}},{{1,18*120},{20,18*120}}},
	["tiêu_hao_nội_lực"]={{{1,12},{20,90}}}
}

SKILL["jiban_fu"] = {
	["tên_kỹ_năng"] = "Ki Bán phù",
	["tốc_độ_di_chuyển_phần_trăm"]={{{1,-22},{20,-52}},{{1,18*20},{20,18*90}}},
	["tiêu_hao_nội_lực"]={{{1,60},{20,60}}}
}

SKILL["qihan_aoxue"] = {
	["tên_kỹ_năng"] = "Khi Hàn Ngạo Tuyết",
	["tốc_độ_đánh_nội_phần_trăm"]={{{1,-6},{20,-39},{30,-50},{31,-50}},{{1,18*45},{20,18*120}}},
	["tiêu_hao_nội_lực"]={{{1,30},{20,40}}}
}

SKILL["kuangfeng_zhoudian"] = {
	["tên_kỹ_năng"] = "Cuồng Phong Sậu Điện",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,10},{20,50},{21,52}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,55},{20,386}}},
	["lôi_sát_ngoại_trong_khoảng"]={
		[1]={{1,45},{20,532}},
		[3]={{1,45},{20,532}}
	},
	["làm_choáng_phần_trăm"]={{{1,5},{20,15},{21,15}},{{1,1},{20,20},{21,20}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,373},{2,373}},
		[3]={{1,1},{20,126}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,28},{20,32},{21,32}}},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,512},{21,512}}},
	["tiêu_hao_nội_lực"]={{{1,25},{20,25}}}
}

SKILL["baichuan_nahai"] = {
	["tên_kỹ_năng"] = "Bách Xuyên Nạp Hải",
	["kháng_băng_phần_trăm"]={{{1,13},{20,32}},{{1,18*120},{20,18*120}}},
	["phòng_thủ_vật_lý_phần_trăm"]={{{1,9},{20,28}},{{1,18*120},{20,18*120}}},
	["tiêu_hao_nội_lực"]={{{1,12},{20,50}}}
}

SKILL["yiqi_sanqing"] = {
	["tên_kỹ_năng"] = "Nhất Khí Tam Thanh",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,35},{20,215}},{{1,18*120},{20,18*120}},{{1,1},{2,1}}},
	["tăng_tấn_công_chí_mạng_phần_trăm"]={{{1,16},{20,35,Conic}},{{1,18*120},{20,18*120}}},
	["tiêu_hao_nội_lực"]={{{1,80},{20,80}}}
}

SKILL["kuanglei_zhendi"] = {
	["tên_kỹ_năng"] = "Cuồng Lôi Chấn Địa",
	["lôi_sát_nội_trong_khoảng"]={
		[1]={{1,27},{20,315}},
		[3]={{1,27},{20,315}}
	},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,1},{20,10}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,375},{2,375}},
		[3]={{1,1},{20,60}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,182},{2,182}},
		[3]={{1,1},{20,35}}
	},
	["phạm_vi_hiệu_quả"]={{{1,320},{20,352}}},
	["tiêu_hao_nội_lực"]={{{1,15},{20,15}}}
}

SKILL["qixin_fu"] = {
	["tên_kỹ_năng"] = "Khí Tâm phù",
	["làm_choáng_phần_trăm"]={{{1,16},{20,35}},{{1,5},{20,36}}},
	["tiêu_hao_nội_lực"]={{{1,100},{20,100}}}
}

SKILL["wulei_zhengfa"] = {
	["tên_kỹ_năng"] = "Ngũ Lôi Chánh Pháp",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,10},{20,50},{21,52}}},
	["lôi_sát_nội_trong_khoảng"]={
		[1]={{1,25},{20,937}},
		[3]={{1,25},{20,937}}
	},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,375},{2,375}},
		[3]={{1,1},{20,70}}
	},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,480},{21,480}}},
	["tiêu_hao_nội_lực"]={{{1,50},{20,90}}}
}

SKILL["shuangao_kunlun"] = {
	["tên_kỹ_năng"] = "Sương Ngạo Côn Lôn",
	["tăng_tấn_công_chí_mạng_phần_trăm"]={{{1,6},{30,15,Conic}},{{1,-1},{2,-1}}},
	["tốc_độ_đánh_nội_phần_trăm"]={{{1,25},{30,65},{34,73},{35,90},{36,92}},{{1,-1},{30,-1}}},
	["tốc_độ_đánh_ngoại_phần_trăm"]={{{1,25},{20,65},{33,92},{35,118},{38,124},{39,126}},{{1,-1},{30,-1}}},
	["lôi_sát_nội"]={{{1,30},{30,315,Conic}},{{1,-1},{2,-1}}},
	["lôi_sát_ngoại"]={{{1,45},{30,315,Conic}},{{1,-1},{2,-1}}}
}

SKILL["aoxue_xiaofeng"] = {
	["tên_kỹ_năng"] = "Ngạo Tuyết Tiêu Phong",
	-- ["thời_gian_tồn_tại_hình_ảnh"]={{{1,16},{20,16}}},
	["thời_gian_tồn_tại_hình_ảnh"]={{{1,20},{20,20}}},
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,5},{15,100},{20,280}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,5},{15,400},{20,950}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{15,20},{20,60},{21,62}}},
	["lôi_sát_ngoại_trong_khoảng"]={
		[1]={{1,39},{15,350},{20,773}},
		[3]={{1,39},{15,350},{20,773}}
	},
	["làm_choáng_phần_trăm"]={{{1,5},{20,25},{21,25}},{{1,1},{20,12},{21,12}}},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,28},{20,32},{21,32}}},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,512},{21,512}}},
	["tiêu_hao_nội_lực"]={{{1,25},{20,45}}},
	["đẳng_cấp_kỹ_năng_phụ"]={{{1,1},{20,20}}},
	["kỹ_năng_phụ_khi_va_chạm"]={
		[1]={{1,0},{10,0},{10,1},{20,1}},
		[3]={{1,373},{20,373}}
	},
	["kỹ_năng_phụ_khi_kết_thúc"]={
		[1]={{1,0},{10,0},{10,1},{20,1}},
		[3]={{1,373},{20,373}}
	},
	["cho_phép_kỹ_năng_phụ"]={{{1,0},{10,0},{10,4},{20,4}}},
	["tổng_kinh_nghiệm_lên_cấp"]={{	
		{1,SkillExpFunc(125,1.25,1,1,1)},
		{2,SkillExpFunc(250,1.15,2,1,1)},
		{3,SkillExpFunc(500,1.16,3,1,1)},
		{4,SkillExpFunc(1000,1.17,4,1,1)},
		{5,SkillExpFunc(2000,1.18,5,1,1.5)},
		{6,SkillExpFunc(3000,1.19,6,1,1.5)},
		{7,SkillExpFunc(4000,1.20,7,1,1.5)},
		{8,SkillExpFunc(5000,1.21,8,1,1.5)},
		{9,SkillExpFunc(6000,1.22,9,1,1.5)},
		{10,SkillExpFunc(7000,1.23,10,1,2)},
		{11,SkillExpFunc(8000,1.24,11,1,2)},
		{12,SkillExpFunc(9000,1.23,12,1,2)},
		{13,SkillExpFunc(10000,1.22,13,1,2)},
		{14,SkillExpFunc(11000,1.21,14,1,2)},
		{15,SkillExpFunc(12000,1.20,15,1,3)},
		{16,SkillExpFunc(13000,1.19,16,1,3)},
		{17,SkillExpFunc(14000,1.18,17,1,3)},
		{18,SkillExpFunc(15000,1.17,18,1,3)},
		{19,SkillExpFunc(16000,1.16,19,1,3)},
		{20,SkillExpFunc(18000,1.15,20,1,4)},
	}},
}

SKILL["xiaofeng_sanlianji"] = {
	["tên_kỹ_năng"] = "Khiếu Phong Tam Liên Kích",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{20,60},{21,62}}},
	["thời_gian_tồn_tại_hình_ảnh"]={{{1,6},{20,24},{21,24}}},
	["lôi_sát_ngoại_trong_khoảng"]={
		[1]={{1,85},{20,330}},
		[3]={{1,115},{20,550}}
	},
}

SKILL["wusuo_kunlun"] = {
	["tên_kỹ_năng"] = "Vụ Tỏa Côn Lôn",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{20,60}}},
	["lôi_sát_nội_trong_khoảng"]={
		[1]={{1,10},{20,256}},
		[3]={{1,10},{20,256}}
	},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,480}}},
	["tiêu_hao_nội_lực"]={{{1,60},{20,85}}},
	["đẳng_cấp_kỹ_năng_phụ"]={{{1,1},{20,20}}},
	["kỹ_năng_phụ_khi_va_chạm"]={
		[1]={{1,0},{10,0},{10,1},{20,1}},
		[3]={{1,375},{20,375}}
	},
	["cho_phép_kỹ_năng_phụ"]={{{1,0},{10,0},{10,4},{20,4}}},
	["tổng_kinh_nghiệm_lên_cấp"]={{{1,20000},{20,84567890,Conic}}},
}

SKILL["leidong_jiutian"] = {
	["tên_kỹ_năng"] = "Lôi động Cửu Thiên",
	["phạm_vi_hiệu_quả"]={{{1,512},{20,512}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{15,20},{20,60},{21,62}}},
	["lôi_sát_nội_trong_khoảng"]={
		-- [1]={{1,80},{15,260},{20,470}},
		-- [3]={{1,80},{15,260},{20,470}}
		[1]={{1,80},{15,300},{20,750}},
		[3]={{1,80},{15,300},{20,750}}
	},
	["tiêu_hao_nội_lực"]={{{1,40},{15,60},{20,95}}},
	["đẳng_cấp_kỹ_năng_phụ"]={{{1,1},{20,20}}},
	["kỹ_năng_phụ_khi_va_chạm"]={
		[1]={{1,0},{10,0},{10,1},{20,1}},
		[3]={{1,387},{20,387}}
	},
	["cho_phép_kỹ_năng_phụ"]={{{1,0},{10,0},{10,4},{20,4}}},
	["tổng_kinh_nghiệm_lên_cấp"]={{	
		{1,SkillExpFunc(125,1.25,1,1,1)},
		{2,SkillExpFunc(250,1.15,2,1,1)},
		{3,SkillExpFunc(500,1.16,3,1,1)},
		{4,SkillExpFunc(1000,1.17,4,1,1)},
		{5,SkillExpFunc(2000,1.18,5,1,1.5)},
		{6,SkillExpFunc(3000,1.19,6,1,1.5)},
		{7,SkillExpFunc(4000,1.20,7,1,1.5)},
		{8,SkillExpFunc(5000,1.21,8,1,1.5)},
		{9,SkillExpFunc(6000,1.22,9,1,1.5)},
		{10,SkillExpFunc(7000,1.23,10,1,2)},
		{11,SkillExpFunc(8000,1.24,11,1,2)},
		{12,SkillExpFunc(9000,1.23,12,1,2)},
		{13,SkillExpFunc(10000,1.22,13,1,2)},
		{14,SkillExpFunc(11000,1.21,14,1,2)},
		{15,SkillExpFunc(12000,1.20,15,1,3)},
		{16,SkillExpFunc(13000,1.19,16,1,3)},
		{17,SkillExpFunc(14000,1.18,17,1,3)},
		{18,SkillExpFunc(15000,1.17,18,1,3)},
		{19,SkillExpFunc(16000,1.16,19,1,3)},
		{20,SkillExpFunc(18000,1.15,20,1,4)},
	}},
}

SKILL["zuixian_cuogu"] = {
	["tên_kỹ_năng"] = "Túy Tiên Tá Cốt 99",
	
	["yêu_cầu_kỹ_năng_1"] = {[1]={{1,392},{20,392}},[3]={{1,1},{20,20}}},
	["yêu_cầu_kỹ_năng_2"] = {[1]={{1,174},{20,174}},[3]={{1,1},{20,20}}},
	["yêu_cầu_kỹ_năng_3"] = {[1]={{1,393},{20,393}},[3]={{1,1},{20,20}}},
	["yêu_cầu_kỹ_năng_4"] = {[1]={{1,175},{20,175}},[3]={{1,1},{20,20}}},
	["yêu_cầu_kỹ_năng_5"] = {[1]={{1,181},{20,181}},[3]={{1,1},{20,20}}},
	
	-- ["tốc_độ_di_chuyển_phần_trăm"]={{{1,-12},{20,-52}},{{1,18*45},{20,18*120}}},
	["thời_gian_làm_chậm_phần_trăm"]={{{1,-5},{20,-50}},{{1,18*45},{20,18*120}}},
	["thời_gian_choáng_phần_trăm"]={{{1,-5},{20,-50}},{{1,18*45},{20,18*120}}},
	["phục_hồi_sinh_lực_mỗi_nửa_giây"]={{{1,-1},{20,-15}},{{1,18*45},{20,18*120}}},
	["phục_hồi_nội_lực_mỗi_nửa_giây"]={{{1,-1},{20,-20}},{{1,18*45},{20,18*120}}},
	["phản_đòn_tầm_xa_phần_trăm"]={{{1,-5},{20,-35}},{{1,18*45},{20,18*120}}},
	["tiêu_hao_nội_lực"]={{{1,100},{20,160}}}
}

SKILL["yufeng_shu"] = {
	["tên_kỹ_năng"] = "Ngự Phong thuật",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{20,60},{21,62}}},
	["sát_thương_vật_lý_nội_phần_trăm"]={{{1,28},{20,282}}},
}

SKILL["pingdi_hanlei"] = {
	["tên_kỹ_năng"] = "Bình Địa Hám Lôi",
	["phạm_vi_hiệu_quả"]={{{1,512},{20,512}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{20,60},{21,62}}},
	-- ["lôi_sát_nội_trong_khoảng"]={
		-- [1]={{1,25},{20,250}},
		-- [3]={{1,25},{20,250}}
	-- },
	["lôi_sát_nội_trong_khoảng"]={
		[1]={{1,25},{20,250}},
		[3]={{1,25},{20,350}}
	},
}

SKILL["shufu_zhou"] = {
	["tên_kỹ_năng"] = "Thúc Phược Chú",
	["phản_đòn_tầm_xa_phần_trăm"]={{{1,-5},{20,-35}},{{1,18*45},{20,18*120}}},
	["tiêu_hao_nội_lực"]={{{1,30},{20,40}}}
}

SKILL["beiming_daohai"] = {
	["tên_kỹ_năng"] = "Bắc Minh Đáo Hải",
	-- ["phục_hồi_sinh_lực_mỗi_nửa_giây"]={{{1,-1},{20,-15}},{{1,18*45},{20,18*120}}},
	["phục_hồi_sinh_lực_mỗi_nửa_giây"]={{{1,-1},{20,-10}},{{1,18*45},{20,18*120}}},
	-- ["phục_hồi_nội_lực_mỗi_nửa_giây"]={{{1,-1},{20,-20}},{{1,18*45},{20,18*120}}},
	["phục_hồi_nội_lực_mỗi_nửa_giây"]={{{1,-1},{20,-10}},{{1,18*45},{20,18*120}}},
	["tiêu_hao_nội_lực"]={{{1,30},{20,40}}}
}

SKILL["xuantianwuji"] = {
	["tên_kỹ_năng"] = "Huyền Thiên Vô Cực",
	["triệt_tiêu_sát_thương_quái"]={{{1,50},{10,100},{15,370},{20,550},{21,550}}},
	["triệt_tiêu_sát_thương_người"]={{{1,50},{10,100},{15,370},{20,550},{21,550}}},
	["kháng_phản_đòn_phần_trăm"]={{{1,5},{20,30},{21,30}},{{1,-1},{20,-1}}},
}

SKILL["kunlun120"] = {
	["tên_kỹ_năng"] = "Lưỡng Nghi Chân Khí",
	["hiển_thị_ma_pháp_kỹ_năng"]={{{1,0},{20,0}}},
	["tự_đánh_khi_máu_thấp_hơn_25_phần_trăm"]={{{1,721*256 + 1},{20,721*256 + 20},{21,721*256 + 21}},{{1,-1},{20,-1}},{{1,20*18*256 + 15},{15,20*18*256 + 60},{20,20*18*256 + 65},{21,20*18*256 + 65}}},
	["mô_tả_kỹ_năng"]=function(level)
		return "Khi sinh lực thấp hơn 25% có xác suất <color=orange>"..math.floor(Link(level,SKILL["kunlun120"]["tự_đánh_khi_máu_thấp_hơn_25_phần_trăm"][3])%256).."%</color> phát chiêu Lưỡng Nghi Chân Khí\n"..
		"Chân khí hộ thể, bảo vệ tính mạng chống lại sát thương gấp <color=orange>"..math.floor(Link(level,SKILL["kunlun120mofadun"]["nội_lực_chống_đỡ_sát_thương_phần_trăm"][1]) / 100).." lần</color> mức nội lực tối đa "..
		"trong <color=orange>"..math.floor(Link(level,SKILL["kunlun120mofadun"]["nội_lực_chống_đỡ_sát_thương_phần_trăm"][2]) / 18).." giây</color>\n"..
		"và tăng <color=orange>"..math.floor((Link(level,SKILL["kunlun120mofadun"]["tốc_độ_di_chuyển_phần_trăm"][1]))).."%</color> "..
		"tốc độ di chuyển trong <color=orange>"..math.floor(Link(level,SKILL["kunlun120mofadun"]["tốc_độ_di_chuyển_phần_trăm"][2]) / 18).." giây</color>\n"..
		"Trong vòng <color=orange>"..math.floor((Link(level,SKILL["kunlun120"]["tự_đánh_khi_máu_thấp_hơn_25_phần_trăm"][3]) / (18*256))).." giây</color> sau mới có thể thi triển tiếp"
	end,
	["tổng_kinh_nghiệm_lên_cấp"]=
	{{
		{1,178512},
		{2,194876},
		{3,227603},
		{4,276694},
		{5,342148},
		{6,423966},
		{7,522148},
		{8,636694},
		{9,767603},
		{10,914876},
		{11,1078512},
		{12,1356694},
		{13,1749421},
		{14,2256694},
		{15,2744181},
		{16,3446181},
		{17,4257381},
		{18,5177781},
		{19,6207381},
		{20,6207381},
	}},	
}

SKILL["kunlun120mofadun"] = {
	["tên_kỹ_năng"] = "Lưỡng Nghi Chân Khí - Ma Pháp",
	["nội_lực_chống_đỡ_sát_thương_phần_trăm"]={{{1,1800},{15,9750},{20,10000},{21,10050}},{{1,5*18},{15,9*18},{20,10*18},{21,10*18}}},
	["tốc_độ_di_chuyển_phần_trăm"]={{{1,5},{15,30},{20,35},{21,36}},{{1,3*18},{15,9*18},{20,10*18},{21,10*18}}},
}
