
SKILL["tangmen_anqi"] = {
	["tên_kỹ_năng"] = "Đường Môn ám khí",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,25},{20,215}},{{1,-1},{2,-1}},{{1,7},{2,7}}},
}

SKILL["pili_dan"] = {
	["tên_kỹ_năng"] = "Tích Lịch đơn",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,20},{20,80}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,1},{20,10}}},
	["độc_sát_ngoại"]={{{1,1},{20,5}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,1},{20,8}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,339},{2,339}},
		[3]={{1,1},{20,45}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,302},{2,302}},
		[3]={{1,1},{20,35}}
	},
	["hỗ_trợ_kỹ_năng_3_phần_trăm"]={
		[1]={{1,342},{2,342}},
		[3]={{1,1},{20,40}}
	},
	["hỗ_trợ_kỹ_năng_4_phần_trăm"]={
		[1]={{1,341},{2,341}},
		[3]={{1,1},{20,35}}
	},
	["hỗ_trợ_kỹ_năng_5_phần_trăm"]={
		[1]={{1,249},{2,249}},
		[3]={{1,1},{20,35}}
	},
	["hỗ_trợ_kỹ_năng_6_phần_trăm"]={
		[1]={{1,58},{2,58}},
		[3]={{1,1},{20,35}}
	},
	["tiêu_hao_nội_lực"]={{{1,12},{20,12}}}
}

SKILL["duohun_biao"] = {
	["tên_kỹ_năng"] = "Đoạt Hồn Tiêu",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,25},{20,115}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,25},{20,200}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,5},{20,30}}},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,2},{20,12}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,342},{2,342}},
		[3]={{1,1},{20,45}}
	},
	["độc_sát_ngoại"]={{{1,3},{20,8}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,24},{20,28}}},
	["phạm_vi_hiệu_quả"]={{{1,384},{20,448}}},
	["tiêu_hao_nội_lực"]={{{1,5},{20,16}}}
}

SKILL["xinyan"] = {
	["tên_kỹ_năng"] = "Tâm Nhãn",
	["băng_sát_ngoại"]={{{1,10},{30,110}},{{1,-1},{2,-1}}},
	["độc_sát_ngoại"]={{{1,1},{30,10}},{{1,-1},{2,-1}},{{1,10},{2,10}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,15},{20,115}},{{1,-1},{2,-1}},{{1,7},{2,7}}},
	["thời_gian_độc_phát_phần_trăm"]={{{1,3},{30,33}},{{1,-1},{2,-1}}},
	["tăng_tấn_công_chí_mạng_phần_trăm"]={{{1,8},{30,26}},{{1,-1},{2,-1}}},
	["tốc_độ_đánh_ngoại_phần_trăm"]={{{1,29},{30,106},{33,113},{34,116},{35,149},{38,156},{39,159},{40,162}},{{1,-1},{2,-1}}},
}

SKILL["zhuixin_jian"] = {
	["tên_kỹ_năng"] = "Truy Tâm Tiễn",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,20},{20,185}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,20},{20,280}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,5},{20,30}}},
	["độc_sát_ngoại"]={{{1,3},{20,8}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,5},{20,15}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,339},{2,339}},
		[3]={{1,1},{20,50}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,24},{20,28}}},
	["phạm_vi_hiệu_quả"]={{{1,384},{20,448}}},
	["tiêu_hao_nội_lực"]={{{1,20},{20,20}}},
}

SKILL["mantian_huayu"] = {
	["tên_kỹ_năng"] = "Mạn Thiên Hoa Vũ",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,30},{20,185}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,30},{20,280}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,5},{20,30}}},
	["độc_sát_ngoại"]={{{1,3},{20,8}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,1},{20,8}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,302},{2,302}},
		[3]={{1,1},{20,45}}
	},
	["phạm_vi_hiệu_quả"]={{{1,384},{20,416}}},
	["tiêu_hao_nội_lực"]={{{1,40},{20,40}}}
}

SKILL["tianluo_diwang"] = {
	["tên_kỹ_năng"] = "Thiên La Địa Võng",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,10},{20,50},{21,52}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,80},{20,344}}},
	["độc_sát_ngoại"]={{{1,5},{20,24}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,5},{20,14}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,302},{2,302}},
		[3]={{1,1},{20,55}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,26},{20,28},{21,28}}},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,512},{21,512}}},
	["tiêu_hao_nội_lực"]={{{1,45},{20,65}}}
}

SKILL["xiaoli_feidao"] = {
	["tên_kỹ_năng"] = "Tiểu Lý Phi Đao",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,10},{20,50},{21,52}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,50},{20,344},{25,344},{26,359}}},
	["độc_sát_ngoại"]={{{1,5},{20,24}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,10},{20,59}}},
	["làm_trọng_thương"]={{{1,10},{20,53},{21,53}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,340},{2,340}},
		[3]={{1,1},{20,82}}
	},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,480}}},
	["tiêu_hao_nội_lực"]={{{1,50},{20,50}}}
}

SKILL["zhuixing_zhudian"] = {
	["tên_kỹ_năng"] = "Truy Tinh Trục Điện",
	["làm_trọng_thương"]={{{1,0},{20,0}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{20,60},{21,62}}},
	-- ["độc_sát_nội"]={{{1,1},{20,10}},{{1,60},{20,60}},{{1,10},{20,10}}}, 
	["sát_thương_vật_lý_ngoại"]={{{1,100},{20,1000}},{{1,18},{2,18}}}, 
	-- ["sát_thương_vật_lý_nội_trong_khoảng"]={	
		-- [1]={{1,10},{20,10}}, 
		-- [3]={{1,10},{20,65}}
	-- },
}

SKILL["baoyu_lihua"] = {
	["tên_kỹ_năng"] = "Bạo Vũ Lê Hoa",
	["làm_trọng_thương"]={{{1,60},{20,60}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{15,20},{20,60},{21,60}}},
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,15},{15,200},{20,434}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,15},{15,300},{20,750}}},
	["tiêu_hao_nội_lực"]={{{1,25},{20,80}}},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,480},{21,480}}},
	-- ["độc_sát_ngoại"]={{{1,1},{20,10}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["độc_sát_ngoại"]={{{1,1},{20,30}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["thời_gian_tồn_tại_hình_ảnh"]={{{1,10},{20,15},{21,15}}},
	["tổng_kinh_nghiệm_lên_cấp"]={{	
		{1,SkillExpFunc(125,1.25,1,1,1)},
		{2,SkillExpFunc(250,1.15,2,1,1)},
		{3,SkillExpFunc(500,1.16,3,1,1)},
		{4,SkillExpFunc(1000,1.17,4,1,1)},
		{5,SkillExpFunc(2000,1.18,5,1,1.5)},
		{6,SkillExpFunc(3000,1.19,6,1,1.5)},
		{7,SkillExpFunc(4000,1.20,7,1,1.5)},
		{8,SkillExpFunc(5000,1.21,8,1,1.5)},
		{9,SkillExpFunc(6000,1.22,9,1,1.5)},
		{10,SkillExpFunc(7000,1.23,10,1,2)},
		{11,SkillExpFunc(8000,1.24,11,1,2)},
		{12,SkillExpFunc(9000,1.23,12,1,2)},
		{13,SkillExpFunc(10000,1.22,13,1,2)},
		{14,SkillExpFunc(11000,1.21,14,1,2)},
		{15,SkillExpFunc(12000,1.20,15,1,3)},
		{16,SkillExpFunc(13000,1.19,16,1,3)},
		{17,SkillExpFunc(14000,1.18,17,1,3)},
		{18,SkillExpFunc(15000,1.17,18,1,3)},
		{19,SkillExpFunc(16000,1.16,19,1,3)},
		{20,SkillExpFunc(18000,1.15,20,1,4)},
	}},
	["đẳng_cấp_kỹ_năng_phụ"]={{{1,1},{20,20}}},
	["kỹ_năng_phụ_khi_đang_bay"]={
		[1]={{1,0},{10,0},{10,1},{20,1}},
		[2]={{1,8},{20,5},{60,4},{61,4}},
		[3]={{1,301},{20,301}}
	},
	["cho_phép_kỹ_năng_phụ"]={{{1,0},{10,0},{10,2},{20,2}}},
}

SKILL["duci_gu"] = {
	["tên_kỹ_năng"] = "Độc Thích Cốt",
	["độc_sát_nội"]={
		[1]={{1,8},{20,40}},
		[2]={{1,100},{20,100}},
		[3]={{1,10},{20,10}}
	},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,1},{20,10}}},
	["tiêu_hao_nội_lực"]={{{1,20},{20,60}}}
}

SKILL["shehun_yueying"] = {
	["tên_kỹ_năng"] = "Nhiếp Hồn Nguyệt ảnh",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,25},{15,150},{20,301}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{15,20},{20,60},{21,62}}},
	["độc_sát_ngoại"]={{{1,5},{20,31}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,10},{20,59}}},
	["tiêu_hao_nội_lực"]={{{1,30},{20,60}}},
	["đẳng_cấp_kỹ_năng_phụ"]={{{1,1},{20,20}}},
	["kỹ_năng_phụ_khi_va_chạm"]={
		[1]={{1,0},{10,0},{10,1},{20,1}},
		[3]={{1,340},{20,340}}
	},
	["cho_phép_kỹ_năng_phụ"]={{{1,0},{10,0},{10,4},{20,4}}},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,28},{20,32},{21,32}}},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,512},{21,512}}},
	["tổng_kinh_nghiệm_lên_cấp"]={{	
		{1,SkillExpFunc(125,1.25,1,1,1)},
		{2,SkillExpFunc(250,1.15,2,1,1)},
		{3,SkillExpFunc(500,1.16,3,1,1)},
		{4,SkillExpFunc(1000,1.17,4,1,1)},
		{5,SkillExpFunc(2000,1.18,5,1,1.5)},
		{6,SkillExpFunc(3000,1.19,6,1,1.5)},
		{7,SkillExpFunc(4000,1.20,7,1,1.5)},
		{8,SkillExpFunc(5000,1.21,8,1,1.5)},
		{9,SkillExpFunc(6000,1.22,9,1,1.5)},
		{10,SkillExpFunc(7000,1.23,10,1,2)},
		{11,SkillExpFunc(8000,1.24,11,1,2)},
		{12,SkillExpFunc(9000,1.23,12,1,2)},
		{13,SkillExpFunc(10000,1.22,13,1,2)},
		{14,SkillExpFunc(11000,1.21,14,1,2)},
		{15,SkillExpFunc(12000,1.20,15,1,3)},
		{16,SkillExpFunc(13000,1.19,16,1,3)},
		{17,SkillExpFunc(14000,1.18,17,1,3)},
		{18,SkillExpFunc(15000,1.17,18,1,3)},
		{19,SkillExpFunc(16000,1.16,19,1,3)},
		{20,SkillExpFunc(18000,1.15,20,1,4)},
	}},
}

SKILL["yindao_sheyue"] = {
	["tên_kỹ_năng"] = "Ngân Đao Xạ Nguyệt",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{20,60},{21,62}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,25},{20,116}}},
}

SKILL["sanhua_biao"] = {
	["tên_kỹ_năng"] = "Tán Hoa Tiêu",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,10},{20,50},{21,52}}},
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,20},{20,274}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,20},{20,110}}},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,10},{20,39}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,342},{2,342}},
		[3]={{1,1},{20,50}}
	},
	["độc_sát_ngoại"]={{{1,5},{20,24}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["tiêu_hao_nội_lực"]={{{1,25},{20,50}}},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,28},{20,32},{21,32}}},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,512},{21,512}}},
}

SKILL["jiugong_feixing"] = {
	["tên_kỹ_năng"] = "Cửu Cung Phi Tinh",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{15,20},{20,60},{21,62}}},
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,10},{15,100},{20,294}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,10},{15,60},{20,125}}},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,10},{20,39}}},
	["độc_sát_ngoại"]={{{1,1},{20,30}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,28},{20,32},{21,32}}},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,512},{21,512}}},
	["tiêu_hao_nội_lực"]={{{1,30},{20,75}}},
	["tổng_kinh_nghiệm_lên_cấp"]={{	
		{1,SkillExpFunc(125,1.25,1,1,1)},
		{2,SkillExpFunc(250,1.15,2,1,1)},
		{3,SkillExpFunc(500,1.16,3,1,1)},
		{4,SkillExpFunc(1000,1.17,4,1,1)},
		{5,SkillExpFunc(2000,1.18,5,1,1.5)},
		{6,SkillExpFunc(3000,1.19,6,1,1.5)},
		{7,SkillExpFunc(4000,1.20,7,1,1.5)},
		{8,SkillExpFunc(5000,1.21,8,1,1.5)},
		{9,SkillExpFunc(6000,1.22,9,1,1.5)},
		{10,SkillExpFunc(7000,1.23,10,1,2)},
		{11,SkillExpFunc(8000,1.24,11,1,2)},
		{12,SkillExpFunc(9000,1.23,12,1,2)},
		{13,SkillExpFunc(10000,1.22,13,1,2)},
		{14,SkillExpFunc(11000,1.21,14,1,2)},
		{15,SkillExpFunc(12000,1.20,15,1,3)},
		{16,SkillExpFunc(13000,1.19,16,1,3)},
		{17,SkillExpFunc(14000,1.18,17,1,3)},
		{18,SkillExpFunc(15000,1.17,18,1,3)},
		{19,SkillExpFunc(16000,1.16,19,1,3)},
		{20,SkillExpFunc(18000,1.15,20,1,4)},
	}},
}

SKILL["chuanxin_ci"] = {
	["tên_kỹ_năng"] = "Xuyên Tâm Thích",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,5},{20,30}}},
	["sát_thương_vật_lý_nội_trong_khoảng"]={
		[1]={{1,60},{20,400}},
		[3]={{1,60},{20,400}}
	},
	["tiêu_hao_nội_lực"]={{{1,20},{20,60}}}
}

SKILL["hanbing_ci"] = {
	["tên_kỹ_năng"] = "Hàn Băng Thích",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,5},{20,30}}},
	["băng_sát_nội_trong_khoảng"]={
		[1]={{1,60},{20,400}},
		[2]={{1,1},{20,18}},
		[3]={{1,60},{20,400}}
	},
	["tiêu_hao_nội_lực"]={{{1,20},{20,60}}}
}

SKILL["diyan_huo"] = {
	["tên_kỹ_năng"] = "Địa Diệm Hỏa",
	["hỏa_sát_nội_trong_khoảng"]={
		[1]={{1,60},{20,400}},
		[3]={{1,60},{20,400}}
	},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,1},{20,10}}},
	["tiêu_hao_nội_lực"]={{{1,20},{20,60}}}
}

SKILL["leiji_shu"] = {
	["tên_kỹ_năng"] = "Lôi Kích Thuật",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,10},{20,50},{21,52}}},
	["lôi_sát_nội_trong_khoảng"]={
		[1]={{1,60},{20,400}},
		[3]={{1,60},{20,400}}
	},
	["làm_choáng_phần_trăm"]={{{1,1},{20,20}},{{1,1},{20,20}}},
	["tiêu_hao_nội_lực"]={{{1,20},{20,60}}}
}

SKILL["luanhuan_ji"] = {
	["tên_kỹ_năng"] = "Loạn Hoàn Kích",
	["thời_gian_hồi_chiêu"]={{{1,2*18},{20,2*18}}},
	["thời_gian_hồi_chiêu_trên_ngựa"]={{{1,0},{15,0},{20,0},{21,0}}},
	["tiêu_hao_nội_lực"]={{{1,60},{20,120}}},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,100},{20,300}}},
	["đẳng_cấp_kỹ_năng_phụ"] = {{{1,1},{20,20}}},
	
	["yêu_cầu_kỹ_năng_1"] = {[1]={{1,347},{20,347}},[3]={{1,1},{20,20}}},
	["yêu_cầu_kỹ_năng_2"] = {[1]={{1,303},{20,303}},[3]={{1,1},{20,20}}},
	["yêu_cầu_kỹ_năng_3"] = {[1]={{1,343},{20,343}},[3]={{1,1},{20,20}}},
	["yêu_cầu_kỹ_năng_4"] = {[1]={{1,345},{20,345}},[3]={{1,1},{20,20}}},
	["yêu_cầu_kỹ_năng_5"] = {[1]={{1,349},{20,349}},[3]={{1,1},{20,20}}},
	
	["hỏa_sát_nội_trong_khoảng"]={
		-- [1]={{1,100},{20,320}},
		-- [3]={{1,100},{20,320}}
		[1]={{1,100},{20,120}},
		[3]={{1,100},{20,120}}
	},
	["độc_sát_nội"]={
		[1]={{1,20},{20,64}},
		[2]={{1,50},{20,50}},
		[3]={{1,10},{20,10}}
	},
	["sát_thương_vật_lý_nội_trong_khoảng"]={
		-- [1]={{1,100},{20,320}},
		-- [3]={{1,100},{20,320}}
		[1]={{1,100},{20,120}},
		[3]={{1,100},{20,120}}
	},
	["băng_sát_nội_trong_khoảng"]={
		-- [1]={{1,100},{20,320}},
		-- [2]={{1,1},{20,5}},
		-- [3]={{1,100},{20,320}}
		[1]={{1,100},{20,120}},
		[3]={{1,100},{20,120}}
	},
	["lôi_sát_nội_trong_khoảng"]={
		-- [1]={{1,100},{20,320}},
		-- [3]={{1,100},{20,320}}
		[1]={{1,100},{20,120}},
		[3]={{1,100},{20,120}}
	},
	["làm_choáng_phần_trăm"]={{{1,1},{20,20}},{{1,1},{20,20}}},
}

SKILL["tangmen120"] = {
	["tên_kỹ_năng"] = "Mê Ảnh Tung",
	["hiển_thị_hiệu_quả_kỹ_năng"]={{{1,0},{20,0}}},
	["hiển_thị_ma_pháp_kỹ_năng"]={{{1,0},{20,0}}},
	["tiêu_hao_nội_lực"]={{{1,25},{20,60}}},
	["thời_gian_hồi_chiêu"]={{{1,15*18},{15,7*18},{20,5*18},{21,5*18}}},
	["thời_gian_hồi_chiêu_trên_ngựa"]={{{1,20*18},{15,10*18},{20,8*18},{21,8*18}}},
	["phạm_vi_hiệu_quả"]={{{1,120},{15,360},{20,400},{21,405}}},
	["mô_tả_kỹ_năng"] = function(level)
		return "Khoảng cách di hình tối đa: <color=orange>"..math.floor(Link(level,SKILL["tangmen120"]["phạm_vi_hiệu_quả"][1])).."</color>\n"..
		"Thời gian khôi phục chiêu thức: <color=orange>"..math.floor(Link(level,SKILL["tangmen120"]["thời_gian_hồi_chiêu"][1]) / 18).." giây</color>\n"..
		"Thời gian khôi phục chiêu thức trên ngựa: <color=orange>"..math.floor(Link(level,SKILL["tangmen120"]["thời_gian_hồi_chiêu_trên_ngựa"][1]) / 18).." giây</color>\n"..
		"Tiêu hao nội lực: "..math.floor(Link(level,SKILL["tangmen120"]["tiêu_hao_nội_lực"][1]))..""
	end,
	["tổng_kinh_nghiệm_lên_cấp"]=
	{{
		{1,178512},
		{2,194876},
		{3,227603},
		{4,276694},
		{5,342148},
		{6,423966},
		{7,522148},
		{8,636694},
		{9,767603},
		{10,914876},
		{11,1078512},
		{12,1356694},
		{13,1749421},
		{14,2256694},
		{15,2744181},
		{16,3446181},
		{17,4257381},
		{18,5177781},
		{19,6207381},
		{20,6207381},
	}},	
}
