
SKILL["emei_jianfa"] = {
	["tên_kỹ_năng"] = "Nga Mi Kiếm pháp",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,15},{20,215}},{{1,-1},{2,-1}},{{1,0},{2,0}}},
	["tăng_tấn_công_chí_mạng_phần_trăm"]={{{1,6},{20,36}},{{1,-1},{2,-1}}}
}

SKILL["emei_zhangfa"] = {
	["tên_kỹ_năng"] = "Nga Mi Chưởng pháp",
	["băng_sát_nội"]={{{1,15},{20,515}},{{1,-1},{2,-1}}}
}

SKILL["piaoyun_chuanxue"] = {
	["tên_kỹ_năng"] = "Phiêu Tuyết Xuyên Vân",
	-- ["sát_thương_vật_lý_nội_trong_khoảng"]={
		-- [1]={{1,10},{20,120}},
		-- [3]={{1,10},{20,120}},
	-- },
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,1},{20,10}}},
	["băng_sát_nội_trong_khoảng"]={
		[1]={{1,15},{20,275}},
		[3]={{1,25},{20,415}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,380},{2,380}},
		[3]={{1,1},{20,75}}
	},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,91},{2,91}},
		[3]={{1,1},{20,35}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,20},{20,24}}},
	["phạm_vi_hiệu_quả"]={{{1,320},{20,384}}},
	["tiêu_hao_nội_lực"]={{{1,10},{20,10}}}
}

SKILL["sixiang_tonggui"] = {
	["tên_kỹ_năng"] = "Tứ Tượng Đồng Quy",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,5},{20,30}}},
	["băng_sát_nội_trong_khoảng"]={
		[1]={{1,35},{20,315}},
		[3]={{1,45},{20,450}}
	},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,331},{2,331}},
		[3]={{1,1},{20,76}}
	},
	["phạm_vi_hiệu_quả"]={{{1,384},{20,416}}},
	["tiêu_hao_nội_lực"]={{{1,25},{20,35}}}
}

SKILL["yiye_zhiqiu"] = {
	["tên_kỹ_năng"] = "Nhất Diệp Tri Thu",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,1},{20,10}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,30},{20,75}}},
	["băng_sát_ngoại_trong_khoảng"]={
		[1]={{1,10},{20,80}},
		[3]={{1,10},{20,80}}
	},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,10},{20,20}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,328},{2,328}},
		[3]={{1,1},{20,60}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,88},{2,88}},
		[3]={{1,1},{20,35}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,20},{20,24}}},
	["phạm_vi_hiệu_quả"]={{{1,320},{20,384}}},
	["tiêu_hao_nội_lực"]={{{1,25},{20,25}}}
}

SKILL["liushui"] = {
	["tên_kỹ_năng"] = "Lưu Thủy",
	["tốc_độ_di_chuyển_phần_trăm"]={{{1,9},{20,66}},{{1,18},{2,18}}}
}

SKILL["bumie_bujue"] = {
	["tên_kỹ_năng"] = "Bất Diệt Bất Tuyệt",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,80},{20,385}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,80},{20,700}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,10},{20,50},{21,52}}},
	["băng_sát_ngoại_trong_khoảng"]={
		[1]={{1,10},{20,282}},
		[3]={{1,10},{20,282}}
	},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,15},{20,54}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,328},{2,328}},
		[3]={{1,1},{20,70}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,28},{20,32},{21,32}}},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,512},{21,512}}},
	["tiêu_hao_nội_lực"]={{{1,30},{20,35}}}
}

SKILL["mengdie"] = {
	["tên_kỹ_năng"] = "Mộng Điệp",
	["phục_hồi_sinh_lực_mỗi_nửa_giây"]={{{1,1},{20,15}},{{1,18},{2,18}}},
	["phục_hồi_nội_lực_mỗi_nửa_giây"]={{{1,1},{20,10}},{{1,18},{2,18}}},
}

SKILL["foguang_puzhao"] = {
	["tên_kỹ_năng"] = "Phật Quang Phổ Chiếu",
	["băng_sát_nội_trong_khoảng"]={
		[1]={{1,70},{20,787}},
		[3]={{1,80},{20,1287}}
	},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,10},{20,50},{21,52}}},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,380},{2,380}},
		[3]={{1,1},{20,80}}
	},
	["tiêu_hao_nội_lực"]={{{1,30},{20,60}}}
}

SKILL["foxin_ciyou"] = {
	["tên_kỹ_năng"] = "Phật Tâm Từ Hữu",
	["sinh_lực_tối_đa_phần_trăm"]={{{1,30},{20,125}},{{1,18*8},{2,18*8}}},
}

SKILL["cihang_pudu"] = {
	["tên_kỹ_năng"] = "Từ Hàng Phổ D",
	["phục_hồi_sinh_lực_mỗi_nửa_giây"]={{{1,275},{20,750}},{{1,36},{2,36}}},
	["tiêu_hao_nội_lực"]={{{1,100},{20,100}}}
}

SKILL["fofa_wubian"] = {
	["tên_kỹ_năng"] = "Phật Pháp Vô Biên",
	["băng_sát_nội"]={{{1,30},{30,315}},{{1,-1},{2,-1}}},
	["băng_sát_ngoại"]={{{1,70},{30,315}},{{1,-1},{2,-1}}},
	["tốc_độ_đánh_ngoại_phần_trăm"]={{{1,12},{30,65},{33,70},{35,90},{38,95},{41,100}},{{1,-1},{2,-1}}},
	["tốc_độ_đánh_nội_phần_trăm"]={{{1,12},{30,65},{33,70},{35,90},{38,95},{41,100}},{{1,-1},{2,-1}}},
	["thời_gian_trì_hoãn_phần_trăm"]={{{1,8},{30,37}},{{1,-1},{2,-1}}}
}

SKILL["qingyin_fanchang"] = {
	["tên_kỹ_năng"] = "Thanh Âm Phạn Xướng",
	["thời_gian_phục_hồi"]={{{1,1},{20,20}},{{1,18},{2,18}}},
	["Kháng_đòn_chí_mạng_phần_trăm"]={{{1,1},{20,20}},{{1,18},{2,18}}},
	["thời_gian_làm_chậm_phần_trăm"]={{{1,1},{20,30}},{{1,18},{2,18}}},
	["thời_gian_trúng_độc_phần_trăm"]={{{1,1},{20,30}},{{1,18},{2,18}}},
	["thời_gian_choáng_phần_trăm"]={{{1,1},{20,30}},{{1,18},{2,18}}}
}

SKILL["sane_jixue"] = {
	["tên_kỹ_năng"] = "Tam Nga Tề Tuyết",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,10},{15,100},{20,237}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,10},{15,100},{20,350}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{15,20},{20,60},{21,62}}},
	["băng_sát_ngoại_trong_khoảng"]={
		[1]={{1,10},{20,111}},
		[3]={{1,10},{20,111}}
	},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,10},{20,54}}},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,28},{20,32},{21,32}}},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,512},{21,512}}},
	["tiêu_hao_nội_lực"]={{{1,35},{20,35}}},
	["đẳng_cấp_kỹ_năng_phụ"]={{{1,1},{20,20}}},
	["kỹ_năng_phụ_khi_bắt_đầu"]={
		[1]={{1,0},{10,0},{10,1},{20,1}},
		[3]={{1,329},{20,329}}
	},
	["cho_phép_kỹ_năng_phụ"]={{{1,0},{10,0},{10,1},{20,1}}},
	["tổng_kinh_nghiệm_lên_cấp"]={{	
		{1,SkillExpFunc(125,1.25,1,1,1)},
		{2,SkillExpFunc(250,1.15,2,1,1)},
		{3,SkillExpFunc(500,1.16,3,1,1)},
		{4,SkillExpFunc(1000,1.17,4,1,1)},
		{5,SkillExpFunc(2000,1.18,5,1,1.5)},
		{6,SkillExpFunc(3000,1.19,6,1,1.5)},
		{7,SkillExpFunc(4000,1.20,7,1,1.5)},
		{8,SkillExpFunc(5000,1.21,8,1,1.5)},
		{9,SkillExpFunc(6000,1.22,9,1,1.5)},
		{10,SkillExpFunc(7000,1.23,10,1,2)},
		{11,SkillExpFunc(8000,1.24,11,1,2)},
		{12,SkillExpFunc(9000,1.23,12,1,2)},
		{13,SkillExpFunc(10000,1.22,13,1,2)},
		{14,SkillExpFunc(11000,1.21,14,1,2)},
		{15,SkillExpFunc(12000,1.20,15,1,3)},
		{16,SkillExpFunc(13000,1.19,16,1,3)},
		{17,SkillExpFunc(14000,1.18,17,1,3)},
		{18,SkillExpFunc(15000,1.17,18,1,3)},
		{19,SkillExpFunc(16000,1.16,19,1,3)},
		{20,SkillExpFunc(18000,1.15,20,1,4)},
	}},
}

SKILL["yuquan_xichen"] = {
	["tên_kỹ_năng"] = "Ngọc Tuyền Tẩy Trần",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,30},{20,148}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{20,60},{21,62}}},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,10},{20,20}}},
}

SKILL["qianfo_qianye"] = {
	["tên_kỹ_năng"] = "Thiên Phật Thiên Diệp",
	["băng_sát_nội_trong_khoảng"]={
		[1]={{1,45},{20,100}},
		[3]={{1,45},{20,100}}
	},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{20,60},{21,62}}},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,512}}},
	["tiêu_hao_nội_lực"]={{{1,30},{20,65}}},
	["đẳng_cấp_kỹ_năng_phụ"]={{{1,1},{20,20}}},
	["kỹ_năng_phụ_khi_bắt_đầu"]={
		[1]={{1,0},{10,0},{10,1},{20,1}},
		[3]={{1,380},{20,380}}
	},
	["cho_phép_kỹ_năng_phụ"]={{{1,0},{10,0},{10,1},{20,1}}},
	["tổng_kinh_nghiệm_lên_cấp"]={{{1,20000},{20,100000000,Conic}}},
}

SKILL["jinding_foguang"] = {
	["tên_kỹ_năng"] = "Kim Đỉnh Phật Quang",
	["băng_sát_nội_trong_khoảng"]={
		[1]={{1,10},{20,585},{21,600}},
		[3]={{1,10},{20,585},{21,600}},
	},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{20,60},{21,62}}},
	-- ["tốc_độ_bay_của_hình_ảnh"]={{{1,24},{20,28},{21,28}}},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,24},{20,32},{21,32}}},
	["số_lượng_hình_ảnh"]={{{1,1},{10,1},{20,3},{21,3}}},
}

SKILL["pudu_zhongsheng"] = {
	["tên_kỹ_năng"] = "Phổ Độ Chúng Sinh",
	["đẳng_cấp_yêu_cầu"] = {{{1,80},{20,80}}},
	
	["yêu_cầu_kỹ_năng_1"] = {[1]={{1,93},{20,93}},[3]={{1,1},{20,20}}},
	["yêu_cầu_kỹ_năng_2"] = {[1]={{1,89},{20,89}},[3]={{1,1},{20,20}}},
	["yêu_cầu_kỹ_năng_3"] = {[1]={{1,86},{20,86}},[3]={{1,1},{20,20}}},
	["yêu_cầu_kỹ_năng_4"] = {[1]={{1,92},{20,92}},[3]={{1,1},{20,20}}},
	["yêu_cầu_kỹ_năng_5"] = {[1]={{1,282},{20,282}},[3]={{1,1},{20,20}}},
	
	["phục_hồi_sinh_lực_mỗi_nửa_giây"]={{{1,1},{20,15}},{{1,18},{2,18}}},
	["phục_hồi_nội_lực_mỗi_nửa_giây"]={{{1,1},{20,10}},{{1,18},{2,18}}},
	["kháng_tất_cả_phần_trăm"]={{{1,1},{20,40}},{{1,18},{2,18}}},
}

SKILL["fengshuang_suiying"] = {
	["tên_kỹ_năng"] = "Phong Sương Toái ảnh",
	["phạm_vi_hiệu_quả"]={{{1,480},{20,480}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{15,20},{20,60},{21,62}}},
	["băng_sát_nội_trong_khoảng"]={
		[1]={{1,20},{15,350},{20,770}},
		[3]={{1,30},{15,400},{20,1000}}
	},
	["đẳng_cấp_kỹ_năng_phụ"]={{{1,1},{20,20}}},
	["tiêu_hao_nội_lực"]={{{1,30},{20,65}}},
	["kỹ_năng_phụ_khi_bắt_đầu"]={
		[1]={{1,0},{10,0},{10,1},{20,1}},
		[3]={{1,331},{20,331}}
	},
	["cho_phép_kỹ_năng_phụ"]={{{1,0},{10,0},{10,1},{20,1}}},
	["tổng_kinh_nghiệm_lên_cấp"]={{	
		{1,SkillExpFunc(125,1.25,1,1,1)},
		{2,SkillExpFunc(250,1.15,2,1,1)},
		{3,SkillExpFunc(500,1.16,3,1,1)},
		{4,SkillExpFunc(1000,1.17,4,1,1)},
		{5,SkillExpFunc(2000,1.18,5,1,1.5)},
		{6,SkillExpFunc(3000,1.19,6,1,1.5)},
		{7,SkillExpFunc(4000,1.20,7,1,1.5)},
		{8,SkillExpFunc(5000,1.21,8,1,1.5)},
		{9,SkillExpFunc(6000,1.22,9,1,1.5)},
		{10,SkillExpFunc(7000,1.23,10,1,2)},
		{11,SkillExpFunc(8000,1.24,11,1,2)},
		{12,SkillExpFunc(9000,1.23,12,1,2)},
		{13,SkillExpFunc(10000,1.22,13,1,2)},
		{14,SkillExpFunc(11000,1.21,14,1,2)},
		{15,SkillExpFunc(12000,1.20,15,1,3)},
		{16,SkillExpFunc(13000,1.19,16,1,3)},
		{17,SkillExpFunc(14000,1.18,17,1,3)},
		{18,SkillExpFunc(15000,1.17,18,1,3)},
		{19,SkillExpFunc(16000,1.16,19,1,3)},
		{20,SkillExpFunc(18000,1.15,20,1,4)},
	}},
}

SKILL["tuichuang_wangyue"] = {
	["tên_kỹ_năng"] = "Thôi Song Vọng Nguyệt",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,40},{20,175}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,40},{20,280}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,5},{20,30}}},
	["băng_sát_ngoại_trong_khoảng"]={
		[1]={{1,10},{20,120}},
		[3]={{1,10},{20,120}}
	},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,10},{20,30}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,329},{2,329}},
		[3]={{1,1},{20,49}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,24},{20,28}}},
	["phạm_vi_hiệu_quả"]={{{1,384},{20,448}}},
	["tiêu_hao_nội_lực"]={{{1,20},{20,20}}}
}

SKILL["emei120"] = {
	["tên_kỹ_năng"] = "Bế Nguyệt Phất Trần",
	["lấy_thông_số_thấp_nhất_từ_kỹ_năng_1"]={{{1,86},{20,86}},{{1,1},{19,19},{20,40},{21,40}}},
	["lấy_thông_số_thấp_nhất_từ_kỹ_năng_2"]={{{1,89},{20,89}},{{1,1},{19,19},{20,40},{21,40}}},
	["lấy_thông_số_thấp_nhất_từ_kỹ_năng_3"]={{{1,92},{20,92}},{{1,1},{19,19},{20,40},{21,40}}},
	["lấy_thông_số_thấp_nhất_từ_kỹ_năng_4"]={{{1,282},{20,282}},{{1,1},{19,19},{20,40},{21,40}}},
	["lấy_thông_số_thấp_nhất_từ_kỹ_năng_5"]={{{1,332},{20,332}},{{1,1},{19,19},{20,40},{21,40}}},
	["mô_tả_kỹ_năng"]=function(level)
		return "Đẳng cấp kỹ năng này sẽ lấy theo kỹ năng hỗ trợ có cấp thấp nhất\n"
	end,
	["tổng_kinh_nghiệm_lên_cấp"]=
	{{
		{1,178512},
		{2,194876},
		{3,227603},
		{4,276694},
		{5,342148},
		{6,423966},
		{7,522148},
		{8,636694},
		{9,767603},
		{10,914876},
		{11,1078512},
		{12,1356694},
		{13,1749421},
		{14,2256694},
		{15,2744181},
		{16,3446181},
		{17,4257381},
		{18,5177781},
		{19,6207381},
		{20,6207381},
	}},	
}
