
SKILL["wudu_daofa"] = {
	["tên_kỹ_năng"] = "Ngũ Độc Đao pháp",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,20},{20,180}},{{1,-1},{20,-1}},{{1,1},{2,1}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,20},{20,250}},{{1,-1},{20,-1}},{{1,1},{2,1}}},
	["tăng_tấn_công_chí_mạng_phần_trăm"]={{{1,6},{20,25}},{{1,-1},{2,-1}}}
}

SKILL["wudu_zhangfa"] = {
	["tên_kỹ_năng"] = "Ngũ Độc Chưởng Pháp",
	-- ["độc_sát_nội"]={{{1,15},{20,45}},{{1,-1},{2,-1}},{{1,10},{2,10}}},
	["độc_sát_nội"]={{{1,15},{20,30}},{{1,-1},{2,-1}},{{1,10},{2,10}}},
}

SKILL["dusha_zhang"] = {
	["tên_kỹ_năng"] = "Độc Sa chưởng",
	["độc_sát_nội"]={{{1,2},{20,26}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,1},{20,10}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,353},{2,353}},
		[3]={{1,2},{20,65}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,71},{2,71}},
		[3]={{1,1},{20,35}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,20},{20,24}}},
	["phạm_vi_hiệu_quả"]={{{1,320},{20,384}}},
	["tiêu_hao_nội_lực"]={{{1,10},{20,10}}}
}

SKILL["binglan_xuanjing"] = {
	["tên_kỹ_năng"] = "Băng Lam Huyền Tinh",
	["kháng_băng_phần_trăm"]={{{1,-9},{20,-49}},{{1,18*20},{20,18*90}}},
	["tiêu_hao_nội_lực"]={{{1,10},{20,60}}}
}

SKILL["xuedao_dusha"] = {
	["tên_kỹ_năng"] = "Huyết Đao Độc Sát",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,15},{20,65}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,1},{20,10}}},
	["độc_sát_ngoại"]={{{1,4},{20,11}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,355},{2,355}},
		[3]={{1,1},{20,60}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,74},{2,74}},
		[3]={{1,1},{20,35}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,20},{20,24}}},
	["phạm_vi_hiệu_quả"]={{{1,320},{20,384}}},
	["tiêu_hao_nội_lực"]={{{1,20},{20,20}}}
}

SKILL["zanan_yaojing"] = {
	["tên_kỹ_năng"] = "Tạp Nan Dược Kinh",
	["kháng_độc_phần_trăm"]={{{1,9},{20,39}},{{1,-1},{2,-1}}}
}

SKILL["jiutian_kuanglei"] = {
	["tên_kỹ_năng"] = "Cửu Thiên Cuồng Lôi",
	["kháng_lôi_phần_trăm"]={{{1,-9},{20,-49}},{{1,18*20},{20,18*90}}},
	["tiêu_hao_nội_lực"]={{{1,10},{20,60}}}
}

SKILL["youming_kulou"] = {
	["tên_kỹ_năng"] = "U Minh Khô Lâu",
	["độc_sát_nội"]={{{1,11},{20,40}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,5},{20,30}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,353},{2,353}},
		[3]={{1,2},{20,85}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,24},{20,28}}},
	["phạm_vi_hiệu_quả"]={{{1,384},{20,448}}},
	["tiêu_hao_nội_lực"]={{{1,40},{20,40}}}
}

SKILL["wuxing_gu"] = {
	["tên_kỹ_năng"] = "Vô Hình Độc",
	["độc_sát_nội"] = {
		-- [1]={{1,1},{20,10}}, 
		[1]={{1,1},{20,30}}, 
		-- [1]={{1,50000},{20,50000}}, 
		[2]={{1,20},{20,20}}, 
		[3]={{1,25},{2,15}}
	},
}

SKILL["chiyan_shitian"] = {
	["tên_kỹ_năng"] = "Xích Diệm Thực Thiên",
	["kháng_hỏa_phần_trăm"]={{{1,-9},{20,-49}},{{1,18*20},{20,18*90}}},
	["tiêu_hao_nội_lực"]={{{1,10},{20,60}}}
}

SKILL["tiangang_disha"] = {
	["tên_kỹ_năng"] = "Thiên Cương Địa Sát",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,10},{20,50},{21,52}}},
	["độc_sát_nội"]={{{1,50},{20,135}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,354},{2,354}},
		[3]={{1,2},{20,181}}
	},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,480}}},
	["tiêu_hao_nội_lực"]={{{1,60},{20,60}}}
}

SKILL["chuanxin_duci"] = {
	["tên_kỹ_năng"] = "Xuyên Tâm Độc Thích",
	["kháng_độc_phần_trăm"]={{{1,-29},{20,-49}},{{1,18*20},{20,18*90}}},
	["tiêu_hao_nội_lực"]={{{1,10},{20,60}}}
}

SKILL["wangu_shixin"] = {
	["tên_kỹ_năng"] = "Vạn Độc Thực Tâm",
	-- ["thời_gian_trúng_độc_phần_trăm"]={{{1,-50},{20,-100}},{{1,18*45},{20,18*120}}},
	["thời_gian_trúng_độc_phần_trăm"]={{{1,-50},{20,-180}},{{1,18*45},{20,18*120}}},
	["tiêu_hao_nội_lực"]={{{1,40},{20,40}}}
}

SKILL["zhuha_qingming"] = {
	["tên_kỹ_năng"] = "Chu Cáp Thanh Minh",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,10},{20,50},{21,52}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,30},{20,392}}},
	["độc_sát_ngoại"]={{{1,16},{20,53}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,355},{2,355}},
		[3]={{1,1},{20,60}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,28},{20,32},{21,32}}},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,512},{21,512}}},
	["tiêu_hao_nội_lực"]={{{1,17},{20,55}}}
}

SKILL["wudu_qijing"] = {
	["tên_kỹ_năng"] = "Ngũ Độc Kỳ Kinh",
	["tốc_độ_đánh_nội_phần_trăm"]={{{1,1},{30,20}},{{1,-1},{30,-1}}},
	["độc_sát_nội"]={{{1,5},{30,100}},{{1,-1},{20,-1}},{{1,11},{2,11}}},
	["độc_sát_ngoại"]={{{1,5},{30,45}},{{1,-1},{20,-1}},{{1,11},{2,11}}},
	["thời_gian_độc_phát_phần_trăm"]={{{1,12},{30,50},{33,53},{35,61},{38,64}},{{1,-1},{2,-1}}},
	["tăng_tấn_công_chí_mạng_phần_trăm"]={{{1,4},{30,45}},{{1,-1},{2,-1}}},
}

SKILL["yinfeng_shigu"] = {
	["tên_kỹ_năng"] = "Âm Phong Thực Cốt",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{15,20},{20,60},{21,62}}},
	["độc_sát_nội"]={{{1,20},{15,50},{20,121}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,480},{21,480}}},
	["tiêu_hao_nội_lực"]={{{1,30},{20,80}}},
	["đẳng_cấp_kỹ_năng_phụ"]={{{1,1},{20,20}}},
	["kỹ_năng_phụ_khi_đang_bay"]={
		[1]={{1,0},{10,0},{10,1},{20,1}},
		[2]={{1,6},{2,6}},
		[3]={{1,388},{20,388}}
	},
	["kỹ_năng_phụ_khi_kết_thúc"]={
		[1]={{1,0},{10,0},{10,1},{20,1}},
		[3]={{1,354},{20,354}}
	},
	["cho_phép_kỹ_năng_phụ"]={{{1,0},{10,0},{10,8},{20,8}}},
	["tổng_kinh_nghiệm_lên_cấp"]={{	
		{1,SkillExpFunc(125,1.25,1,1,1)},
		{2,SkillExpFunc(250,1.15,2,1,1)},
		{3,SkillExpFunc(500,1.16,3,1,1)},
		{4,SkillExpFunc(1000,1.17,4,1,1)},
		{5,SkillExpFunc(2000,1.18,5,1,1.5)},
		{6,SkillExpFunc(3000,1.19,6,1,1.5)},
		{7,SkillExpFunc(4000,1.20,7,1,1.5)},
		{8,SkillExpFunc(5000,1.21,8,1,1.5)},
		{9,SkillExpFunc(6000,1.22,9,1,1.5)},
		{10,SkillExpFunc(7000,1.23,10,1,2)},
		{11,SkillExpFunc(7000,1.24,11,1,2)},
		{12,SkillExpFunc(7000,1.23,12,1,2)},
		{13,SkillExpFunc(8000,1.22,13,1,2)},
		{14,SkillExpFunc(8000,1.21,14,1,2)},
		{15,SkillExpFunc(8000,1.20,15,1,3)},
		{16,SkillExpFunc(9000,1.19,16,1,3)},
		{17,SkillExpFunc(9000,1.18,17,1,3)},
		{18,SkillExpFunc(9000,1.17,18,1,3)},
		{19,SkillExpFunc(10000,1.16,19,1,3)},
		{20,SkillExpFunc(10000,1.15,20,1,4)},
	}},
}

SKILL["tiangang_dushou"] = {
	["tên_kỹ_năng"] = "Thiên Cương Độc Thủ",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{20,60},{21,62}}},
	["độc_sát_nội"]={{{1,1},{20,15}},{{1,80},{20,60}},{{1,10},{20,10}}},
}

SKILL["xuanyin_zhan"] = {
	["tên_kỹ_năng"] = "Huyền Âm Trảm",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{15,20},{20,60},{21,62}}},
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,15},{15,80},{20,173}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,15},{15,100},{20,250}}},
	["độc_sát_ngoại"]={{{1,20},{15,30},{20,60}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,28},{20,40},{21,40}}},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,512},{21,512}}},
	["tiêu_hao_nội_lực"]={{{1,30},{20,60}}},
	["tổng_kinh_nghiệm_lên_cấp"]={{	
		{1,SkillExpFunc(125,1.25,1,1,1)},
		{2,SkillExpFunc(250,1.15,2,1,1)},
		{3,SkillExpFunc(500,1.16,3,1,1)},
		{4,SkillExpFunc(1000,1.17,4,1,1)},
		{5,SkillExpFunc(2000,1.18,5,1,1.5)},
		{6,SkillExpFunc(3000,1.19,6,1,1.5)},
		{7,SkillExpFunc(4000,1.20,7,1,1.5)},
		{8,SkillExpFunc(5000,1.21,8,1,1.5)},
		{9,SkillExpFunc(6000,1.22,9,1,1.5)},
		{10,SkillExpFunc(7000,1.23,10,1,2)},
		{11,SkillExpFunc(8000,1.24,11,1,2)},
		{12,SkillExpFunc(9000,1.23,12,1,2)},
		{13,SkillExpFunc(10000,1.22,13,1,2)},
		{14,SkillExpFunc(11000,1.21,14,1,2)},
		{15,SkillExpFunc(12000,1.20,15,1,3)},
		{16,SkillExpFunc(13000,1.19,16,1,3)},
		{17,SkillExpFunc(14000,1.18,17,1,3)},
		{18,SkillExpFunc(15000,1.17,18,1,3)},
		{19,SkillExpFunc(16000,1.16,19,1,3)},
		{20,SkillExpFunc(18000,1.15,20,1,4)},
	}},
	["đẳng_cấp_kỹ_năng_phụ"]={{{1,1},{20,20}}},
	["kỹ_năng_phụ_khi_va_chạm"]={
		[1]={{1,0},{10,0},{10,1},{20,1}},
		[3]={{1,383},{20,383}}
	},
	["cho_phép_kỹ_năng_phụ"]={{{1,0},{10,0},{10,4},{20,4}}},
}

SKILL["chuanyi_pojia"] = {
	["tên_kỹ_năng"] = "Xuyên Y Phá Giáp",
	["phòng_thủ_vật_lý_phần_trăm"]={{{1,-9},{20,-49}},{{1,18*20},{20,18*90}}},
	["tiêu_hao_nội_lực"]={{{1,10},{20,60}}}
}

SKILL["xingkong_po"] = {
	["tên_kỹ_năng"] = "Tinh Không Phá",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{20,60},{21,62}}},
	["độc_sát_ngoại"]={{{1,1},{20,10}},{{1,60},{20,60}},{{1,10},{20,10}}},
}

SKILL["baidu_chuanxin"] = {
	["tên_kỹ_năng"] = "Bách Độc Xuyên Tâm",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,10},{20,95}}}, 
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,20},{20,500}}}, 
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,5},{20,30}}},
	-- ["độc_sát_ngoại"]={{{1,4},{20,20}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["độc_sát_ngoại"]={{{1,4},{20,40}},{{1,60},{20,60}},{{1,10},{20,10}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,383},{2,383}},
		[3]={{1,1},{20,70}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,24},{20,28}}},
	["phạm_vi_hiệu_quả"]={{{1,384},{20,448}}},
	["tiêu_hao_nội_lực"]={{{1,10},{20,32}}}
}

SKILL["zhuifeng_duji"] = {
	["tên_kỹ_năng"] = "Truy Phong Độc Cát",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{20,60},{21,62}}},
	["độc_sát_nội"]={{{1,1},{20,15}},{{1,60},{20,60}},{{1,10},{20,10}}},
}

SKILL["duanjin_fugu"] = {
	["tên_kỹ_năng"] = "Đoạn Cân Hủ Cốt",
	
	["yêu_cầu_kỹ_năng_1"] = {[1]={{1,67},{20,67}},[3]={{1,1},{20,20}}},
	["yêu_cầu_kỹ_năng_2"] = {[1]={{1,70},{20,70}},[3]={{1,1},{20,20}}},
	["yêu_cầu_kỹ_năng_3"] = {[1]={{1,64},{20,64}},[3]={{1,1},{20,20}}},
	["yêu_cầu_kỹ_năng_4"] = {[1]={{1,356},{20,356}},[3]={{1,1},{20,20}}},
	["yêu_cầu_kỹ_năng_5"] = {[1]={{1,72},{20,72}},[3]={{1,1},{20,20}}},
	
	["kháng_tất_cả_phần_trăm"]={{{1,-1},{20,-40}},{{1,18*20},{20,18*90}}},
	["tiêu_hao_nội_lực"]={{{1,60},{20,120}}}
}

SKILL["wudu120"] = {
	["tên_kỹ_năng"] = "Hấp Tinh Yểm",
	["hiển_thị_ma_pháp_kỹ_năng"]={{{1,0},{20,0}}},
	["tự_đánh_khi_xuất_chiêu"]=
	{
		{{1,719*256 + 1},{20,719*256 + 20},{21,719*256 + 21}},
		{{1,-1},{20,-1}},
		{{1,10*18*256 + 1},{15,10*18*256 + 12},{20,10*18*256 + 15},{21,10*18*256 + 15}}
	},
	["mô_tả_kỹ_năng"] = function(level)
		return "Xác suất <color=orange>"..math.floor(Link(level,SKILL["wudu120"]["tự_đánh_khi_xuất_chiêu"][3]) % 256).."%</color> khiến cho đối thương bị độc sát,\n"..
		" đồng thời làm giảm <color=orange>"..math.floor(Link(level,SKILL["wudu120zuzhou"]["hạ_độc_giảm_nội_lực_phần_trăm"][1])).."%</color> nội lực đối phương"..
		" trong <color=orange>"..math.floor(Link(level,SKILL["wudu120zuzhou"]["hạ_độc_giảm_nội_lực_phần_trăm"][2]) / 18).." giây</color>\n"..
		" <color=orange>"..math.floor((Link(level,SKILL["wudu120"]["tự_đánh_khi_xuất_chiêu"][3]) / (18*256))).." giây</color> sau mới có thể thi triển tiếp"
	end,
	["tổng_kinh_nghiệm_lên_cấp"]=
	{{
		{1,178512},
		{2,194876},
		{3,227603},
		{4,276694},
		{5,342148},
		{6,423966},
		{7,522148},
		{8,636694},
		{9,767603},
		{10,914876},
		{11,1078512},
		{12,1356694},
		{13,1749421},
		{14,2256694},
		{15,2744181},
		{16,3446181},
		{17,4257381},
		{18,5177781},
		{19,6207381},
		{20,6207381},
	}},	
}

SKILL["wudu120zuzhou"] = {
	["tên_kỹ_năng"] = "Hấp Tinh Yểm 719",
	["hạ_độc_giảm_nội_lực_phần_trăm"]=
	{
		{{1,30},{15,80},{20,85},{21,85}},
		{{1,3*18},{15,5*18},{20,6*18},{21,6*18}}
	},
}
