
SKILL["shaolin_gunfa"] = {
	["tên_kỹ_năng"] = "Thiếu Lâm Côn pháp",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,25},{20,100}},{{1,-1},{2,-1}},{{1,2},{2,2}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,25},{20,200}},{{1,-1},{2,-1}},{{1,2},{2,2}}},
	["độ_chính_xác_phần_trăm"]={{{1,35},{20,275}},{{1,-1},{2,-1}}},
	["tăng_tấn_công_chí_mạng_phần_trăm"]={{{1,6},{20,45,Conic}},{{1,-1},{2,-1}}}
}

SKILL["shaolin_daofa"] = {
	["tên_kỹ_năng"] = "Thiếu Lâm Đao pháp",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,25},{20,215}},{{1,-1},{2,-1}},{{1,1},{2,1}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,25},{20,400}},{{1,-1},{2,-1}},{{1,1},{2,1}}},
	["tăng_tấn_công_chí_mạng_phần_trăm"]={{{1,5},{20,15,Conic}},{{1,-1},{2,-1}}}
}

SKILL["shaolin_quanfa"] = {
	["tên_kỹ_năng"] = "Thiếu Lâm Quyền Pháp",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,25},{20,415}},{{1,-1},{2,-1}},{{1,9},{2,9}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,25},{20,515}},{{1,-1},{2,-1}},{{1,9},{2,9}}},
	["độ_chính_xác_phần_trăm"]={{{1,35},{20,275}},{{1,-1},{2,-1}}},
	["tăng_tấn_công_chí_mạng_phần_trăm"]={{{1,6},{20,45,Conic}},{{1,-1},{2,-1}}}
}

SKILL["jingang_fumo"] = {
	["tên_kỹ_năng"] = "Kim Cang Phục Ma",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,15},{20,55}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,1},{20,10}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,321},{2,321}},
		[3]={{1,1},{20,61}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,319},{2,319}},
		[3]={{1,1},{20,64}}
	},
	["hỗ_trợ_kỹ_năng_3_phần_trăm"]={
		[1]={{1,11},{2,11}},
		[3]={{1,1},{20,35}}
	},
	["hỗ_trợ_kỹ_năng_4_phần_trăm"]={
		[1]={{1,19},{2,19}},
		[3]={{1,1},{20,35}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,18},{20,18}}},
	["thời_gian_tồn_tại_hình_ảnh"]={{{1,4},{20,4}}},
	["phạm_vi_hiệu_quả"]={{{1,54},{20,54}}},
	["tiêu_hao_nội_lực"]={{{1,2},{20,6}}}
}

SKILL["hengsao_liuhe"] = {
	["tên_kỹ_năng"] = "Hoành Tảo Lục Hợp",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,71},{20,417}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,10},{20,50},{21,52}}},
	["độ_chính_xác_phần_trăm"]={{{1,12},{20,50}}},
	["băng_sát_ngoại_trong_khoảng"]={
		[1]={{1,10},{20,56}},
		[3]={{1,10},{20,56}}
	},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,10},{20,30}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,319},{2,319}},
		[3]={{1,1},{20,96/2}}
	},
	["phạm_vi_hiệu_quả"]={{{1,96},{20,96}}},
	["tiêu_hao_nội_lực"]={{{1,8},{20,8}}}
}

SKILL["xinglong_buyu"] = {
	["tên_kỹ_năng"] = "Hàng Long Bất Vũ",
	-- ["sát_thương_vật_lý_ngoại_trong_khoảng"]={
		-- [1]={{1,60},{20,520}},
		-- [3]={{1,60},{20,520}},
	-- },
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,60},{20,250}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,1},{20,10}}},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,5},{20,20}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,318},{2,318}},
		[3]={{1,1},{20,150}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,317},{2,317}},
		[3]={{1,1},{20,150}}
	},
	["hỗ_trợ_kỹ_năng_3_phần_trăm"]={
		[1]={{1,271},{2,271}},
		[3]={{1,1},{20,35}}
	},
	["hỗ_trợ_kỹ_năng_4_phần_trăm"]={
		[1]={{1,272},{2,272}},
		[3]={{1,1},{20,35}}
	},
	-- ["tiêu_hao_nội_lực"]={{{1,2},{20,10}}},
	["tiêu_hao_nội_lực"]={{{1,5},{10,5},{11,10},{20,10}}},
}

SKILL["budong_mingwang"] = {
	["tên_kỹ_năng"] = "Bất động Minh Vương",
	["độ_chính_xác_phần_trăm"]={{{1,28},{20,275}},{{1,18*120},{20,18*180}}},
	["né_tránh"]={{{1,15},{20,250}},{{1,18*120},{20,18*180}}},
	["tiêu_hao_nội_lực"]={{{1,10},{20,40}}}
}

SKILL["luohan_zhen"] = {
	["tên_kỹ_năng"] = "La Hán Trận",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,11},{20,135}},{{1,18},{2,18}},{{1,6},{2,6}}},
	-- ["phản_đòn_cận_chiến_phần_trăm"]={{{1,1},{20,45},{21,46},{25,50},{26,50}},{{1,18},{2,18}}},
	-- ["phản_đòn_tầm_xa_phần_trăm"]={{{1,1},{20,45},{25,50},{26,50}},{{1,18},{2,18}}},
	["phản_đòn_cận_chiến_phần_trăm"]={{{1,1},{20,20}},{{1,18},{2,18}}},
	["phản_đòn_tầm_xa_phần_trăm"]={{{1,1},{20,20}},{{1,18},{2,18}}},
	["né_tránh"]={{{1,40},{20,800}},{{1,18},{2,18}}},
}

SKILL["longzhao_huzhua"] = {
	["tên_kỹ_năng"] = "Long Trảo Hổ Trảo (##)",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,120},{20,1242}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,10},{20,50},{21,52}}},
	["bỏ_qua_né_tránh_phần_trăm"]={{{1,9},{20,85},{21,86}}},
	["làm_choáng_phần_trăm"]={{{1,1},{20,5}},{{1,1},{20,5}}},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,5},{20,40}}},
	["băng_sát_ngoại_trong_khoảng"]={
		[1]={{1,10},{20,56}},
		[3]={{1,10},{20,56}}
	},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,318},{2,318}},
		[3]={{1,1},{20,110},{25,150},{27,161}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,317},{2,317}},
		[3]={{1,1},{20,110},{25,150},{27,161}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,26},{20,26}}},
	["thời_gian_tồn_tại_hình_ảnh"]={{{1,4},{20,4}}},
	["phạm_vi_hiệu_quả"]={{{1,78},{20,78}}},
	["tiêu_hao_nội_lực"]={{{1,1},{20,16}}}
}

SKILL["mohe_wuliang"] = {
	["tên_kỹ_năng"] = "Ma Ha Vô Lượng",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,52},{20,372}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,10},{20,50},{21,52}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,321},{2,321}},
		[3]={{1,1},{20,92/2}}
	},
	["băng_sát_ngoại_trong_khoảng"]={
		[1]={{1,10},{20,56}},
		[3]={{1,10},{20,56}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,28},{20,32}}},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,512}}},
	["tiêu_hao_nội_lực"]={{{1,15},{20,35}}}
}

SKILL["shizi_hou"] = {
	["tên_kỹ_năng"] = "Sư Tử Hống",
	["làm_choáng_phần_trăm"]={{{1,15},{20,65},{21,66}},{{1,5},{20,27},{21,28}}},
	["sát_thương_vật_lý_ngoại_trong_khoảng"]={
		[1]={{1,45},{20,140}},
		[3]={{1,45},{20,140}}
	},
	["tiêu_hao_nội_lực"]={{{1,10},{20,60}}},
	["đẳng_cấp_kỹ_năng_phụ"]={{{1,1},{20,20}}},
}

SKILL["yijin_jing"] = {
	["tên_kỹ_năng"] = "Dịch Cân kinh",
	["kháng_tất_cả_phần_trăm"]={{{1,1},{20,20}},{{1,-1},{2,-1}}},
	["phản_đòn_cận_chiến_phần_trăm"]={{{1,1},{20,20},{21,20}}},
	["phản_đòn_tầm_xa_phần_trăm"]={{{1,1},{20,20},{25,20}}},
}

SKILL["rulai_qianye"] = {
	["tên_kỹ_năng"] = "Như Lai Thiên Diệp",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,65},{30,215}},{{1,18*120},{30,18*360}},{{1,6},{2,6}}},
	["sinh_lực_tối_đa_phần_trăm"]={{{1,3},{30,80}},{{1,18*120},{30,18*360}}},
	["băng_sát_ngoại"]={{{1,10},{30,215}},{{1,18*120},{30,18*360}}},
	["tăng_tấn_công_chí_mạng_phần_trăm"]={{{1,5},{30,15}},{{1,18*120},{30,18*360}}},
	["tốc_độ_đánh_ngoại_phần_trăm"]={{{1,35},{30,65},{36,71},{38,93},{41,96},{42,98}},{{1,18*120},{30,18*360}}},
	["tiêu_hao_nội_lực"]={{{1,15},{30,45}}}
}

SKILL["damo_dujiang"] = {
	["tên_kỹ_năng"] = "Đạt Ma Độ Giang",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,55},{15,345},{20,615}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{15,20},{20,60},{21,62}}},
	["bỏ_qua_né_tránh_phần_trăm"]={{{1,9},{20,90},{21,94},{22,98},{23,99},{24,99},}},
	["tiêu_hao_nội_lực"]={{{1,15},{20,35}}},
	["băng_sát_ngoại_trong_khoảng"]={
		[1]={{1,10},{20,155}},
		[3]={{1,10},{20,155}}
	},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,5},{20,40}}},
	["tổng_kinh_nghiệm_lên_cấp"]={{	
		{1,SkillExpFunc(125,1.25,1,1,1)},
		{2,SkillExpFunc(250,1.15,2,1,1)},
		{3,SkillExpFunc(500,1.16,3,1,1)},
		{4,SkillExpFunc(1000,1.17,4,1,1)},
		{5,SkillExpFunc(2000,1.18,5,1,1.5)},
		{6,SkillExpFunc(3000,1.19,6,1,1.5)},
		{7,SkillExpFunc(4000,1.20,7,1,1.5)},
		{8,SkillExpFunc(5000,1.21,8,1,1.5)},
		{9,SkillExpFunc(6000,1.22,9,1,1.5)},
		{10,SkillExpFunc(7000,1.23,10,1,2)},
		{11,SkillExpFunc(8000,1.24,11,1,2)},
		{12,SkillExpFunc(9000,1.23,12,1,2)},
		{13,SkillExpFunc(10000,1.22,13,1,2)},
		{14,SkillExpFunc(11000,1.21,14,1,2)},
		{15,SkillExpFunc(12000,1.20,15,1,3)},
		{16,SkillExpFunc(13000,1.19,16,1,3)},
		{17,SkillExpFunc(14000,1.18,17,1,3)},
		{18,SkillExpFunc(15000,1.17,18,1,3)},
		{19,SkillExpFunc(16000,1.16,19,1,3)},
		{20,SkillExpFunc(18000,1.15,20,1,4)},
	}},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,30},{20,30}}},
	["thời_gian_tồn_tại_hình_ảnh"]={{{1,4},{20,4}}},
	["phạm_vi_hiệu_quả"]={{{1,90},{20,90}}},
}

SKILL["hengsao_qianjun"] = {
	["tên_kỹ_năng"] = "Hoành Tảo Thiên Quân",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,10},{15,150},{20,353}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{15,20},{20,60},{21,62}}},
	["tiêu_hao_nội_lực"]={{{1,15},{20,20}}},
	["độ_chính_xác_phần_trăm"]={{{1,45},{20,412}}},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,10},{20,30}}},
	["băng_sát_ngoại_trong_khoảng"]={
		[1]={{1,10},{20,114}},
		[3]={{1,10},{20,114}}
	},
	["phạm_vi_hiệu_quả"]={{{1,128},{20,128}}},
	["tổng_kinh_nghiệm_lên_cấp"]={{	
		{1,SkillExpFunc(125,1.25,1,1,1)},
		{2,SkillExpFunc(250,1.15,2,1,1)},
		{3,SkillExpFunc(500,1.16,3,1,1)},
		{4,SkillExpFunc(1000,1.17,4,1,1)},
		{5,SkillExpFunc(2000,1.18,5,1,1.5)},
		{6,SkillExpFunc(3000,1.19,6,1,1.5)},
		{7,SkillExpFunc(4000,1.20,7,1,1.5)},
		{8,SkillExpFunc(5000,1.21,8,1,1.5)},
		{9,SkillExpFunc(6000,1.22,9,1,1.5)},
		{10,SkillExpFunc(7000,1.23,10,1,2)},
		{11,SkillExpFunc(8000,1.24,11,1,2)},
		{12,SkillExpFunc(9000,1.23,12,1,2)},
		{13,SkillExpFunc(10000,1.22,13,1,2)},
		{14,SkillExpFunc(11000,1.21,14,1,2)},
		{15,SkillExpFunc(12000,1.20,15,1,3)},
		{16,SkillExpFunc(13000,1.19,16,1,3)},
		{17,SkillExpFunc(14000,1.18,17,1,3)},
		{18,SkillExpFunc(15000,1.17,18,1,3)},
		{19,SkillExpFunc(16000,1.16,19,1,3)},
		{20,SkillExpFunc(18000,1.15,20,1,4)},
	}},
}

SKILL["wuxiang_zhan"] = {
	["tên_kỹ_năng"] = "Vô Tướng Trảm",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,45},{15,150},{20,333}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,45},{15,250},{20,750}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{15,20},{20,60},{21,62}}},
	["băng_sát_ngoại_trong_khoảng"]={
		[1]={{1,10},{20,111}},
		[3]={{1,10},{20,111}}
	},
	["tiêu_hao_nội_lực"]={{{1,15},{20,45}}},
	["tổng_kinh_nghiệm_lên_cấp"]={{	
		{1,SkillExpFunc(125,1.25,1,1,1)},
		{2,SkillExpFunc(250,1.15,2,1,1)},
		{3,SkillExpFunc(500,1.16,3,1,1)},
		{4,SkillExpFunc(1000,1.17,4,1,1)},
		{5,SkillExpFunc(2000,1.18,5,1,1.5)},
		{6,SkillExpFunc(3000,1.19,6,1,1.5)},
		{7,SkillExpFunc(4000,1.20,7,1,1.5)},
		{8,SkillExpFunc(5000,1.21,8,1,1.5)},
		{9,SkillExpFunc(6000,1.22,9,1,1.5)},
		{10,SkillExpFunc(7000,1.23,10,1,2)},
		{11,SkillExpFunc(8000,1.24,11,1,2)},
		{12,SkillExpFunc(9000,1.23,12,1,2)},
		{13,SkillExpFunc(10000,1.22,13,1,2)},
		{14,SkillExpFunc(11000,1.21,14,1,2)},
		{15,SkillExpFunc(12000,1.20,15,1,3)},
		{16,SkillExpFunc(13000,1.19,16,1,3)},
		{17,SkillExpFunc(14000,1.18,17,1,3)},
		{18,SkillExpFunc(15000,1.17,18,1,3)},
		{19,SkillExpFunc(16000,1.16,19,1,3)},
		{20,SkillExpFunc(18000,1.15,20,1,4)},
	}},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,28},{20,32}}},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,512}}},
}

SKILL["dachengrulaizhou"] = {
	["tên_kỹ_năng"] = "Đại Thừa Như Lai Chú",
	["phản_đòn_khi_bị_trúng_độc_p"]={{{1,5},{15,40},{20,45},{21,45}},{{1,-1},{2,-1}}},
	["xs_phản_đòn_bùa_chú_p"]={{{1,5},{15,50},{20,56},{21,57}},{{1,-1},{2,-1}}},
	["tự_phản_hồi_khi_bị_đánh"]=
	{
		{{1,20 * 256 + 1},{20,20 * 256 + 20},{21,20*256 + 21}},
		{{1,-1},{2,-1}},
		{{1,10*18*256 + 1},{19,4*18*256 + 3},{20,5*18*256 + 3},{21,5*18*256 + 3}}
	},
	["tổng_kinh_nghiệm_lên_cấp"]=
	{{
		{1,178512},
		{2,194876},
		{3,227603},
		{4,276694},
		{5,342148},
		{6,423966},
		{7,522148},
		{8,636694},
		{9,767603},
		{10,914876},
		{11,1078512},
		{12,1356694},
		{13,1749421},
		{14,2256694},
		{15,2744181},
		{16,3446181},
		{17,4257381},
		{18,5177781},
		{19,6207381},
		{20,6207381},
	}},	
}
