
SKILL["tianwang_qiangfa"] = {
	["tên_kỹ_năng"] = "Thiên Vương Thương pháp",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,25},{20,315}},{{1,-1},{2,-1}},{{1,3},{2,3}}},
	["độ_chính_xác_phần_trăm"]={{{1,75},{20,270}},{{1,-1},{2,-1}}},
	["tăng_tấn_công_chí_mạng_phần_trăm"]={{{1,2},{20,15}},{{1,-1},{2,-1}}}
}

SKILL["tianwang_daofa"] = {
	["tên_kỹ_năng"] = "Thiên Vương Đao pháp",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,50},{20,300}},{{1,-1},{2,-1}},{{1,1},{2,1}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,50},{20,350}},{{1,-1},{2,-1}},{{1,1},{2,1}}},
	["độ_chính_xác_phần_trăm"]={{{1,15},{20,72}},{{1,-1},{2,-1}}},
	["tăng_tấn_công_chí_mạng_phần_trăm"]={{{1,2},{20,15}},{{1,-1},{2,-1}}}
}

SKILL["tianwang_chuifa"] = {
	["tên_kỹ_năng"] = "Thiên Vương Chùy Pháp",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,25},{20,275}},{{1,-1},{2,-1}},{{1,4},{2,4}}},
	["độ_chính_xác_phần_trăm"]={{{1,15},{20,72}},{{1,-1},{2,-1}}},
	["tăng_tấn_công_chí_mạng_phần_trăm"]={{{1,2},{20,15}},{{1,-1},{2,-1}}}
}

SKILL["zhanlong_jue"] = {
	["tên_kỹ_năng"] = "Trảm Long quyết",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,80},{20,185}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,160},{20,370}}},
	["bỏ_qua_né_tránh_phần_trăm"]={{{1,5},{20,20}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,1},{20,10}}},
	-- ["băng_sát_ngoại_trong_khoảng"]={
		-- [1]={{1,1},{20,25}},
		-- [3]={{1,2},{20,50}}
	-- },
	["tấn_công_chí_mạng_phần_trăm"]={{{1,6},{20,10}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,325},{2,325}},
		[3]={{1,1},{20,50}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,408},{2,408}},
		[3]={{1,1},{20,50}}
	},
	["hỗ_trợ_kỹ_năng_3_phần_trăm"]={
		[1]={{1,324},{2,324}},
		[3]={{1,1},{20,35}}
	},
	["hỗ_trợ_kỹ_năng_4_phần_trăm"]={
		[1]={{1,407},{2,407}},
		[3]={{1,1},{20,35}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,18},{20,18}}},
	["thời_gian_tồn_tại_hình_ảnh"]={{{1,4},{20,4}}},
	["phạm_vi_hiệu_quả"]={{{1,54},{20,54}}},
	["tiêu_hao_sinh_lực"]={{{1,2},{20,6}}}
}

SKILL["huifeng_luoyan"] = {
	["tên_kỹ_năng"] = "Hồi Phong Lạc Nhạn",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,1},{20,10}}},
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,80},{20,215}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,160},{20,430}}},
	["độ_chính_xác_phần_trăm"]={{{1,10},{20,147}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,323},{2,323}},
		[3]={{1,1},{20,60}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,327},{2,327}},
		[3]={{1,1},{20,60}}
	},
	["hỗ_trợ_kỹ_năng_3_phần_trăm"]={
		[1]={{1,41},{2,41}},
		[3]={{1,1},{20,15}}
	},
	["hỗ_trợ_kỹ_năng_4_phần_trăm"]={
		[1]={{1,225},{2,225}},
		[3]={{1,1},{20,35}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,18},{20,18}}},
	["thời_gian_tồn_tại_hình_ảnh"]={{{1,4},{20,4}}},
	["phạm_vi_hiệu_quả"]={{{1,54},{20,54}}},
	["tiêu_hao_sinh_lực"]={{{1,4},{20,10}}}
}

SKILL["xingyun_jue"] = {
	["tên_kỹ_năng"] = "Hàng Vân Quyết",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,30},{20,255}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,60},{20,650}}},
	["bỏ_qua_né_tránh_phần_trăm"]={{{1,10},{20,35}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,5},{20,30}}},
	-- ["băng_sát_ngoại_trong_khoảng"]={
		-- [1]={{1,5},{20,50}},
		-- [3]={{1,100},{20,100}}
	-- },
	["tấn_công_chí_mạng_phần_trăm"]={{{1,8},{20,20}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,325},{2,325}},
		[3]={{1,1},{20,55},{25,95},{29,116}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,408},{2,408}},
		[3]={{1,1},{20,55},{25,95},{29,116}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,22},{20,22}}},
	["thời_gian_tồn_tại_hình_ảnh"]={{{1,4},{20,4}}},
	["phạm_vi_hiệu_quả"]={{{1,66},{20,66}}},
	["tiêu_hao_sinh_lực"]={{{1,3},{20,7}}}
}

SKILL["wuxin_zhan"] = {
	["tên_kỹ_năng"] = "Vô Tâm Trảm",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,65},{20,453}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,130},{20,1100}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,10},{20,50},{21,52}}},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,4},{20,25}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,322},{2,322}},
		[3]={{1,1},{20,80}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,326},{2,326}},
		[3]={{1,1},{20,80}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,26},{20,26}}},
	["thời_gian_tồn_tại_hình_ảnh"]={{{1,4},{20,4}}},
	["phạm_vi_hiệu_quả"]={{{1,78},{20,78}}},
	["tiêu_hao_sinh_lực"]={{{1,10},{20,20}}}
}

SKILL["jingxin_jue"] = {
	["tên_kỹ_năng"] = "Tĩnh Tâm Quyết",
	["độ_chính_xác_phần_trăm"]={{{1,45},{20,400}},{{1,18*120},{20,18*180}}},
	["tiêu_hao_sinh_lực"]={{{1,5},{20,20}}}
}

SKILL["jinglei_zhan"] = {
	["tên_kỹ_năng"] = "Kinh Lôi Trảm",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,40},{20,200}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,80},{20,400}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,1},{20,10}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,322},{2,322}},
		[3]={{1,1},{20,60}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,326},{2,326}},
		[3]={{1,1},{20,60}}
	},
	["hỗ_trợ_kỹ_năng_3_phần_trăm"]={
		[1]={{1,32},{2,32}},
		[3]={{1,1},{20,35}}
	},
	["hỗ_trợ_kỹ_năng_4_phần_trăm"]={
		[1]={{1,220},{2,220}},
		[3]={{1,1},{20,35}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,18},{20,18}}},
	["thời_gian_tồn_tại_hình_ảnh"]={{{1,4},{20,4}}},
	["phạm_vi_hiệu_quả"]={{{1,54},{20,54}}},
	["tiêu_hao_sinh_lực"]={{{1,5},{20,10}}}
}

SKILL["yangguan_sandie"] = {
	["tên_kỹ_năng"] = "Dương Quan Tam Điệp",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,130},{20,375}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,260},{20,850}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,5},{20,30}}},
	["độ_chính_xác_phần_trăm"]={{{1,10},{20,180}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,323},{2,323}},
		[3]={{1,1},{20,65},{25,105},{29,118}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,327},{2,327}},
		[3]={{1,1},{20,65},{25,105},{29,118}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,22},{20,22}}},
	["thời_gian_tồn_tại_hình_ảnh"]={{{1,4},{20,4}}},
	["phạm_vi_hiệu_quả"]={{{1,66},{20,66}}},
	["tiêu_hao_sinh_lực"]={{{1,9},{20,16}}}
}

SKILL["tianwang_zhanyi"] = {
	["tên_kỹ_năng"] = "Thiên Vương Chiến ý",
	["sinh_lực_tối_đa_phần_trăm"]={{{1,21},{30,185}},{{1,-1},{30,-1}}},
	["tăng_tấn_công_chí_mạng_phần_trăm"]={{{1,5},{30,45}},{{1,-1},{30,-1}}},
	-- ["tốc_độ_đánh_ngoại_phần_trăm"]={{{1,5},{30,65}},{{1,-1},{30,-1}}},
	["tiêu_hao_sinh_lực"]={{{1,10},{30,50}}}
}

SKILL["pofeng_zhan"] = {
	["tên_kỹ_năng"] = "Bát Phong Trảm",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,120},{20,275}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,240},{20,520}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,5},{20,30}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,322},{2,322}},
		[3]={{1,1},{20,70},{25,110},{27,117}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,326},{2,326}},
		[3]={{1,1},{20,70},{25,110},{27,117}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,22},{20,22}}},
	["thời_gian_tồn_tại_hình_ảnh"]={{{1,4},{20,4}}},
	["phạm_vi_hiệu_quả"]={{{1,66},{20,66}}},
	["tiêu_hao_sinh_lực"]={{{1,8},{20,12}}}
}

SKILL["duanhun_ci"] = {
	["tên_kỹ_năng"] = "Đoạn Hồn Thích",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,25},{20,215}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,1},{20,50}}},
	["làm_choáng_phần_trăm"]={{{1,16},{20,35}},{{1,5},{20,18}}},
	skill_param1_v={{{1,4},{5,12},{20,24},{28,31},{31,31}}},
	skill_param2_v={{{1,18},{20,1},{21,1}}},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,4},{20,80}}},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,22},{20,30},{21,32},{22,32}}},
	["phạm_vi_hiệu_quả"]={{{1,22*16},{20,30*16},{21,30*16}}},
	["tiêu_hao_sinh_lực"]={{{1,10},{20,20}}}
}

SKILL["xuezhan_bafang"] = {
	["tên_kỹ_năng"] = "Huyết Chiến Bát Phương",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,60},{20,723}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,10},{20,50},{21,52}}},
	["độ_chính_xác_phần_trăm"]={{{1,75},{20,320}}},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,4},{20,25}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,323},{2,323}},
		[3]={{1,1},{20,70}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,327},{2,327}},
		[3]={{1,1},{20,70}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,26},{20,26}}},
	["thời_gian_tồn_tại_hình_ảnh"]={{{1,4},{20,4}}},
	["phạm_vi_hiệu_quả"]={{{1,78},{20,78}}},
	["tiêu_hao_sinh_lực"]={{{1,11},{20,45}}}
}

SKILL["jinzhong_zhao"] = {
	["tên_kỹ_năng"] = "Kim Chung Tráo",
	["phòng_thủ_vật_lý_phần_trăm"]={{{1,12},{20,50}},{{1,18*120},{20,18*180}}},
	["kháng_độc_phần_trăm"]={{{1,12},{20,49}},{{1,18*120},{20,18*180}}},
	["kháng_băng_phần_trăm"]={{{1,7},{20,45}},{{1,18*120},{20,18*180}}},
	["kháng_hỏa_phần_trăm"]={{{1,-5},{20,-15},{21,-15}},{{1,18*120},{20,18*180}}},
	["tiêu_hao_sinh_lực"]={{{1,12},{20,40}}}
}

SKILL["potian_zhan"] = {
	["tên_kỹ_năng"] = "Phá Thiên Trảm",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,35},{15,150},{20,338}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,35},{15,150},{20,550}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{15,20},{20,60},{21,62}}},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,4},{20,25}}},
	["độ_chính_xác_phần_trăm"]={{{1,35},{20,215}}},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,30},{20,30}}},
	["thời_gian_tồn_tại_hình_ảnh"]={{{1,4},{20,4}}},
	["phạm_vi_hiệu_quả"]={{{1,90},{20,90}}},
	["tiêu_hao_sinh_lực"]={{{1,15},{20,30}}},
	["tổng_kinh_nghiệm_lên_cấp"]={{	
		{1,SkillExpFunc(125,1.25,1,1,1)},
		{2,SkillExpFunc(250,1.15,2,1,1)},
		{3,SkillExpFunc(500,1.16,3,1,1)},
		{4,SkillExpFunc(1000,1.17,4,1,1)},
		{5,SkillExpFunc(2000,1.18,5,1,1.5)},
		{6,SkillExpFunc(3000,1.19,6,1,1.5)},
		{7,SkillExpFunc(4000,1.20,7,1,1.5)},
		{8,SkillExpFunc(5000,1.21,8,1,1.5)},
		{9,SkillExpFunc(6000,1.22,9,1,1.5)},
		{10,SkillExpFunc(7000,1.23,10,1,2)},
		{11,SkillExpFunc(8000,1.24,11,1,2)},
		{12,SkillExpFunc(9000,1.23,12,1,2)},
		{13,SkillExpFunc(10000,1.22,13,1,2)},
		{14,SkillExpFunc(11000,1.21,14,1,2)},
		{15,SkillExpFunc(12000,1.20,15,1,3)},
		{16,SkillExpFunc(13000,1.19,16,1,3)},
		{17,SkillExpFunc(14000,1.18,17,1,3)},
		{18,SkillExpFunc(15000,1.17,18,1,3)},
		{19,SkillExpFunc(16000,1.16,19,1,3)},
		{20,SkillExpFunc(18000,1.15,20,1,4)},
	}},
}

SKILL["zhuixing_zhuyue"] = {
	["tên_kỹ_năng"] = "Truy Tinh Trục Nguyệt",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,50},{15,200},{20,381}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,50},{15,150},{20,450}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{15,20},{20,60},{21,62}}},
	["độ_chính_xác_phần_trăm"]={{{1,95},{20,360}}},
	["tấn_công_chí_mạng_phần_trăm"]={{{1,4},{20,25}}},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,30},{20,30}}},
	["thời_gian_tồn_tại_hình_ảnh"]={{{1,4},{20,4}}},
	["phạm_vi_hiệu_quả"]={{{1,90},{20,90}}},
	["tiêu_hao_sinh_lực"]={{{1,10},{20,65}}},
	["tổng_kinh_nghiệm_lên_cấp"]={{	
		{1,SkillExpFunc(125,1.25,1,1,1)},
		{2,SkillExpFunc(250,1.15,2,1,1)},
		{3,SkillExpFunc(500,1.16,3,1,1)},
		{4,SkillExpFunc(1000,1.17,4,1,1)},
		{5,SkillExpFunc(2000,1.18,5,1,1.5)},
		{6,SkillExpFunc(3000,1.19,6,1,1.5)},
		{7,SkillExpFunc(4000,1.20,7,1,1.5)},
		{8,SkillExpFunc(5000,1.21,8,1,1.5)},
		{9,SkillExpFunc(6000,1.22,9,1,1.5)},
		{10,SkillExpFunc(7000,1.23,10,1,2)},
		{11,SkillExpFunc(8000,1.24,11,1,2)},
		{12,SkillExpFunc(9000,1.23,12,1,2)},
		{13,SkillExpFunc(10000,1.22,13,1,2)},
		{14,SkillExpFunc(11000,1.21,14,1,2)},
		{15,SkillExpFunc(12000,1.20,15,1,3)},
		{16,SkillExpFunc(13000,1.19,16,1,3)},
		{17,SkillExpFunc(14000,1.18,17,1,3)},
		{18,SkillExpFunc(15000,1.17,18,1,3)},
		{19,SkillExpFunc(16000,1.16,19,1,3)},
		{20,SkillExpFunc(18000,1.15,20,1,4)},
	}},
}

SKILL["chenglong_jue"] = {
	["tên_kỹ_năng"] = "Thừa Long Quyết",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,40},{20,495}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,80},{20,1100}}},
	["bỏ_qua_né_tránh_phần_trăm"]={{{1,38},{20,80},{21,82}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,10},{20,50},{21,52}}},
	-- ["băng_sát_ngoại_trong_khoảng"]={
		-- [1]={{1,10},{20,100}},
		-- [3]={{1,20},{20,200}}
	-- },
	["tấn_công_chí_mạng_phần_trăm"]={{{1,5},{20,40}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,325},{2,325}},
		[3]={{1,1},{20,60}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,408},{2,408}},
		[3]={{1,1},{20,60}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,26},{20,26}}},
	["thời_gian_tồn_tại_hình_ảnh"]={{{1,4},{20,4}}},
	["phạm_vi_hiệu_quả"]={{{1,78},{20,78}}},
	["tiêu_hao_sinh_lực"]={{{1,10},{20,16}}}
}

SKILL["zhuifeng_jue"] = {
	["tên_kỹ_năng"] = "Truy Phong Quyết",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,25},{15,140},{20,380}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,25},{15,140},{20,450}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{15,20},{20,60},{21,62}}},
	["bỏ_qua_né_tránh_phần_trăm"]={{{1,12},{20,90},{21,94},{22,98},{23,99},{24,99}}},
	-- ["băng_sát_ngoại_trong_khoảng"]={
		-- [1]={{1,1},{20,50}},
		-- [3]={{1,5},{20,250}}
	-- },
	["tấn_công_chí_mạng_phần_trăm"]={{{1,5},{20,40}}},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,30},{20,30}}},
	["thời_gian_tồn_tại_hình_ảnh"]={{{1,4},{20,4}}},
	["phạm_vi_hiệu_quả"]={{{1,90},{20,90}}},
	["tổng_kinh_nghiệm_lên_cấp"]={{	
		{1,SkillExpFunc(125,1.25,1,1,1)},
		{2,SkillExpFunc(250,1.15,2,1,1)},
		{3,SkillExpFunc(500,1.16,3,1,1)},
		{4,SkillExpFunc(1000,1.17,4,1,1)},
		{5,SkillExpFunc(2000,1.18,5,1,1.5)},
		{6,SkillExpFunc(3000,1.19,6,1,1.5)},
		{7,SkillExpFunc(4000,1.20,7,1,1.5)},
		{8,SkillExpFunc(5000,1.21,8,1,1.5)},
		{9,SkillExpFunc(6000,1.22,9,1,1.5)},
		{10,SkillExpFunc(7000,1.23,10,1,2)},
		{11,SkillExpFunc(8000,1.24,11,1,2)},
		{12,SkillExpFunc(9000,1.23,12,1,2)},
		{13,SkillExpFunc(10000,1.22,13,1,2)},
		{14,SkillExpFunc(11000,1.21,14,1,2)},
		{15,SkillExpFunc(12000,1.20,15,1,3)},
		{16,SkillExpFunc(13000,1.19,16,1,3)},
		{17,SkillExpFunc(14000,1.18,17,1,3)},
		{18,SkillExpFunc(15000,1.17,18,1,3)},
		{19,SkillExpFunc(16000,1.16,19,1,3)},
		{20,SkillExpFunc(18000,1.15,20,1,4)},
	}},
	["tiêu_hao_sinh_lực"]={{{1,10},{20,30}}}
}

SKILL["daoxutian"] = {
	["tên_kỹ_năng"] = "Đảo Hư Thiên",
	["kháng_tất_cả_phần_trăm"]={{{1,1},{20,10},{21,10}},{{1,-1},{2,-1}}},
	["kháng_tất_cả_tối_đa_phần_trăm"]={{{1,1},{20,5},{21,5}},{{1,-1},{2,-1}}},
	["tăng_hồi_sinh_lực_phần_trăm"]={{{1,1},{15,30},{20,35},{21,36}},{{1,-1},{2,-1}}},
	["xs_bỏ_qua_bùa_giảm_kháng_p"]={{{1,5},{15,79},{20,89},{21,89}},{{1,-1},{2,-1}}},
	["tổng_kinh_nghiệm_lên_cấp"]=
	{{
		{1,178512},
		{2,194876},
		{3,227603},
		{4,276694},
		{5,342148},
		{6,423966},
		{7,522148},
		{8,636694},
		{9,767603},
		{10,914876},
		{11,1078512},
		{12,1356694},
		{13,1749421},
		{14,2256694},
		{15,2744181},
		{16,3446181},
		{17,4257381},
		{18,5177781},
		{19,6207381},
		{20,6207381},
	}},	
}
