
SKILL["cuiyan_daofa"] = {
	["tên_kỹ_năng"] = "Thúy Yên Đao pháp",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,45},{20,215}},{{1,-1},{2,-1}},{{1,1},{2,1}}},
	["tăng_tấn_công_chí_mạng_phần_trăm"]={{{1,6},{20,35,Conic}},{{1,-1},{2,-1}}}
}

SKILL["cuiyan_shuangdao"] = {
	["tên_kỹ_năng"] = "Thúy Yên Song đao",
	["băng_sát_nội"]={{{1,20},{20,215}},{{1,-1},{2,-1}}}
}

SKILL["fenghua_xueyue"] = {
	["tên_kỹ_năng"] = "Phong Hoa Tuyết Nguyệt",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,5},{20,85}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,1},{20,10}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,336},{2,336}},
		[3]={{1,1},{20,55}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,108},{2,108}},
		[3]={{1,1},{20,35}}
	},
	["băng_sát_ngoại_trong_khoảng"]={
		[1]={{1,5},{20,80}},
		[3]={{1,5},{20,150}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,20},{20,24}}},
	["phạm_vi_hiệu_quả"]={{{1,320},{20,384}}},
	["tiêu_hao_nội_lực"]={{{1,10},{20,10}}}
}

SKILL["huti_hanbing"] = {
	["tên_kỹ_năng"] = "Hộ Thể Hàn Băng",
	["phản_đòn_cận_chiến_phần_trăm"]={{{1,5},{20,20}},{{1,18*120},{20,18*120}}},
	["phản_đòn_tầm_xa_phần_trăm"]={{{1,5},{20,20}},{{1,18*120},{20,18*120}}},
	["tiêu_hao_nội_lực"]={{{1,40},{20,60}}}
}

SKILL["fengjuan_canxue"] = {
	["tên_kỹ_năng"] = "Phong Quyển Tàn Tuyết",
	["server_số_lượng_hình_ảnh"]={{{1,1},{20,1}}},
	["server_kỹ_năng_phụ_khi_bắt_đầu"]={{{1,0},{20,0}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,1},{20,10}}},
	["sát_thương_vật_lý_nội_trong_khoảng"]={
		[1]={{1,25},{20,235}},
		[3]={{1,25},{20,375}},
	},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,337},{2,337}},
		[3]={{1,1},{20,115}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,111},{2,111}},
		[3]={{1,1},{20,35}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,20},{20,24}}},
	["phạm_vi_hiệu_quả"]={{{1,320},{20,384}}},
	["tiêu_hao_nội_lực"]={{{1,20},{20,20}}}
}

SKILL["yuda_lihua"] = {
	["tên_kỹ_năng"] = "Vũ Đả Lê Hoa",
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,10},{20,140}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,5},{20,30}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,382},{2,382}},
		[3]={{1,15},{20,50}}
	},
	["băng_sát_ngoại_trong_khoảng"]={
		[1]={{1,10},{20,100}},
		[3]={{1,10},{20,250}}
	},
	["phạm_vi_hiệu_quả"]={{{1,384},{20,448}}},
	["tiêu_hao_nội_lực"]={{{1,20},{20,30}}}
}

SKILL["muye_liuxing"] = {
	["tên_kỹ_năng"] = "Mục Dã Lưu Tinh",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,10},{20,50},{21,52}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,30},{20,271}}},
	["băng_sát_ngoại_trong_khoảng"]={
		[1]={{1,20},{20,246}},
		[3]={{1,20},{20,426}}
	},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,336},{2,336}},
		[3]={{1,1},{20,60}}
	},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,480},{21,480}}},
	["tiêu_hao_nội_lực"]={{{1,30},{20,40}}}
}

SKILL["xueying"] = {
	["tên_kỹ_năng"] = "Tuyết ảnh",
	["tốc_độ_đánh_ngoại_phần_trăm"]={{{1,12},{20,65},{23,73},{25,90},{28,99},{42,111},{43,119},{44,122}},{{1,18*120},{20,18*180}}},
	["tốc_độ_đánh_nội_phần_trăm"]={{{1,12},{20,65},{23,73},{25,90},{28,99},{42,111},{43,119},{44,122}},{{1,18*120},{20,18*180}}},
	["tốc_độ_di_chuyển_phần_trăm"]={{{1,17},{20,55}},{{1,18*120},{20,18*180}}},
	["tiêu_hao_nội_lực"]={{{1,40},{20,140}}}
}

SKILL["bihai_chaosheng"] = {
	["tên_kỹ_năng"] = "Bích Hải Triều Sinh",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,10},{20,50},{21,52}}},
	["sát_thương_vật_lý_nội_trong_khoảng"]={
		[1]={{1,20},{20,200}},
		[3]={{1,20},{20,200}},
	},
	["băng_sát_nội_trong_khoảng"]={
		[1]={{1,43},{20,704}},
		[3]={{1,43},{20,1214}}
	},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,337},{2,337}},
		[3]={{1,2},{20,70}}
	},
	["hỗ_trợ_kỹ_năng_2_phần_trăm"]={
		[1]={{1,338},{2,338}},
		[3]={{1,2},{20,65}}
	},
	["tiêu_hao_nội_lực"]={{{1,65},{20,65}}}
}

SKILL["fuyun_sanxue"] = {
	["tên_kỹ_năng"] = "Phù Vân Tán Tuyết",
	-- ["băng_sát_nội_trong_khoảng"]={
		-- [1]={{1,40},{20,375}},
		-- [3]={{1,40},{20,575}}
	-- },
	["băng_sát_nội_trong_khoảng"]={
		[1]={{1,40},{20,500}},
		[3]={{1,40},{20,700}}
	},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,5},{20,30}}},
	["hỗ_trợ_kỹ_năng_1_phần_trăm"]={
		[1]={{1,338},{2,338}},
		[3]={{1,1},{20,100}}
	},
	["phạm_vi_hiệu_quả"]={{{1,384},{20,416}}},
	["tiêu_hao_nội_lực"]={{{1,50},{20,50}}}
}

SKILL["binggu_xuexin"] = {
	["tên_kỹ_năng"] = "Băng Cốt Tuyết Tâm",
	["băng_sát_nội"]={{{1,60},{30,315}},{{1,-1},{2,-1}}},
	["băng_sát_ngoại"]={{{1,30},{30,275}},{{1,-1},{2,-1}}},
	["sát_thương_vật_lý_nội"]={{{1,30},{30,275}},{{1,-1},{2,-1}}},
	["tăng_tấn_công_chí_mạng_phần_trăm"]={{{1,5},{30,45,Conic}},{{1,-1},{2,-1}}},
	["thời_gian_trì_hoãn_phần_trăm"]={{{1,8},{30,80}},{{1,-1},{2,-1}}}
}

SKILL["bingxin_qianying"] = {
	["tên_kỹ_năng"] = "Băng Tâm Trái ảnh",
	["phục_hồi_sinh_lực_mỗi_nửa_giây"]={{{1,130},{20,700}},{{1,8},{2,8}}},
	["tiêu_hao_nội_lực"]={{{1,21},{20,40}}}
}

SKILL["taxue_wuhen"] = {
	["tên_kỹ_năng"] = "Đạp Tuyết Vô Ngân",
}

SKILL["bingzong_wuying"] = {
	["tên_kỹ_năng"] = "Băng Tung Vô ảnh",
	-- ["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,15},{15,100},{20,146}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,15},{15,100},{20,250}}},
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{15,20},{20,60},{21,62}}},
	["băng_sát_ngoại_trong_khoảng"]={
		[1]={{1,10},{15,140},{20,173}},
		[3]={{1,50},{15,200},{20,276}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,20},{20,24},{21,24}}},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,512},{21,512}}},
	["tiêu_hao_nội_lực"]={{{1,40},{20,60}}},
	["đẳng_cấp_kỹ_năng_phụ"]={{{1,1},{20,20}}},
	["kỹ_năng_phụ_khi_va_chạm"]={
		[1]={{1,0},{10,0},{10,1},{20,1}},
		[3]={{1,382},{20,382}}
	},
	["cho_phép_kỹ_năng_phụ"]={{{1,0},{10,0},{10,4},{20,4}}},
	["số_lượng_hình_ảnh"]={{{1,1},{5,1},{20,5},{21,5}}},
	["tổng_kinh_nghiệm_lên_cấp"]={{	
		{1,SkillExpFunc(125,1.25,1,1,1)},
		{2,SkillExpFunc(250,1.15,2,1,1)},
		{3,SkillExpFunc(500,1.16,3,1,1)},
		{4,SkillExpFunc(1000,1.17,4,1,1)},
		{5,SkillExpFunc(2000,1.18,5,1,1.5)},
		{6,SkillExpFunc(3000,1.19,6,1,1.5)},
		{7,SkillExpFunc(4000,1.20,7,1,1.5)},
		{8,SkillExpFunc(5000,1.21,8,1,1.5)},
		{9,SkillExpFunc(6000,1.22,9,1,1.5)},
		{10,SkillExpFunc(7000,1.23,10,1,2)},
		{11,SkillExpFunc(8000,1.24,11,1,2)},
		{12,SkillExpFunc(9000,1.23,12,1,2)},
		{13,SkillExpFunc(10000,1.22,13,1,2)},
		{14,SkillExpFunc(11000,1.21,14,1,2)},
		{15,SkillExpFunc(12000,1.20,15,1,3)},
		{16,SkillExpFunc(13000,1.19,16,1,3)},
		{17,SkillExpFunc(14000,1.18,17,1,3)},
		{18,SkillExpFunc(15000,1.17,18,1,3)},
		{19,SkillExpFunc(16000,1.16,19,1,3)},
		{20,SkillExpFunc(18000,1.15,20,1,4)},
	}},
}

SKILL["bingxin_xianzi"] = {
	["tên_kỹ_năng"] = "Băng Tâm Tiên Tử",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{15,20},{20,60},{21,62}}},
	-- ["sát_thương_vật_lý_nội_trong_khoảng"]={
		-- [1]={{1,5},{15,100},{20,430}},
		-- [3]={{1,5},{15,100},{20,430}},
	-- },
	["sát_thương_vật_lý_nội_trong_khoảng"]={
		[1]={{1,5},{15,100},{20,500}},
		[3]={{1,5},{15,100},{20,500}},
	},
	["băng_sát_nội_trong_khoảng"]={
		[1]={{1,15},{15,240},{20,700}},
		[3]={{1,15},{15,240},{20,700}}
	},
	["tốc_độ_bay_của_hình_ảnh"]={{{1,28},{20,32},{21,32}}},
	["phạm_vi_hiệu_quả"]={{{1,448},{20,512},{21,512}}},
	["tiêu_hao_nội_lực"]={{{1,45},{20,75}}},
	["thời_gian_trì_hoãn_phần_trăm"]={{{1,8},{30,80}},{{1,-1},{2,-1}}},
	["đẳng_cấp_kỹ_năng_phụ"]={{{1,1},{20,20}}},
	["kỹ_năng_phụ_khi_đang_bay"]={
		[1]={{1,0},{10,0},{10,1},{20,1}},
		[2]={{1,3},{2,3}},
		[3]={{1,338},{20,338}}
	},
	["cho_phép_kỹ_năng_phụ"]={{{1,0},{10,0},{10,2},{20,2}}},
	["tổng_kinh_nghiệm_lên_cấp"]={{	
		{1,SkillExpFunc(125,1.25,1,1,1)},
		{2,SkillExpFunc(250,1.15,2,1,1)},
		{3,SkillExpFunc(500,1.16,3,1,1)},
		{4,SkillExpFunc(1000,1.17,4,1,1)},
		{5,SkillExpFunc(2000,1.18,5,1,1.5)},
		{6,SkillExpFunc(3000,1.19,6,1,1.5)},
		{7,SkillExpFunc(4000,1.20,7,1,1.5)},
		{8,SkillExpFunc(5000,1.21,8,1,1.5)},
		{9,SkillExpFunc(6000,1.22,9,1,1.5)},
		{10,SkillExpFunc(7000,1.23,10,1,2)},
		{11,SkillExpFunc(8000,1.24,11,1,2)},
		{12,SkillExpFunc(9000,1.23,12,1,2)},
		{13,SkillExpFunc(10000,1.22,13,1,2)},
		{14,SkillExpFunc(11000,1.21,14,1,2)},
		{15,SkillExpFunc(12000,1.20,15,1,3)},
		{16,SkillExpFunc(13000,1.19,16,1,3)},
		{17,SkillExpFunc(14000,1.18,17,1,3)},
		{18,SkillExpFunc(15000,1.17,18,1,3)},
		{19,SkillExpFunc(16000,1.16,19,1,3)},
		{20,SkillExpFunc(18000,1.15,20,1,4)},
	}},
}

SKILL["fengxue_bingtian"] = {
	["tên_kỹ_năng"] = "Phong Tuyết Băng Thiên",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{20,60},{21,62}}},
	["băng_sát_nội_trong_khoảng"]={
		[1]={{1,45},{20,600}},
		[3]={{1,45},{20,600}}
	},
}

SKILL["bingxin_yuling"] = {
	["tên_kỹ_năng"] = "Băng Tâm Ngọc Lăng",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{20,60},{21,62}}},
	["sát_thương_vật_lý_nội_phần_trăm"]={{{1,15},{20,115}}},
	["băng_sát_nội_trong_khoảng"]={
		[1]={{1,10},{20,440}},
		[3]={{1,10},{20,440}}
	},
	["đẳng_cấp_kỹ_năng_phụ"]={{{1,1},{20,20}}},
	["kỹ_năng_phụ_khi_va_chạm"]={
		[1]={{1,0},{15,0},{15,1},{20,1}},
		[3]={{1,382},{20,382}}
	},
	["cho_phép_kỹ_năng_phụ"]={{{1,0},{15,0},{15,4},{20,4}}},
}

SKILL["bingxin_xuelian"] = {
	["tên_kỹ_năng"] = "Băng Tâm Tuyết Liên",
	["ngũ_hành_tương_khắc_phần_trăm"]={{{1,20},{20,60},{21,62}}},
	["sát_thương_vật_lý_ngoại_phần_trăm"]={{{1,15},{20,115}}},
	["băng_sát_ngoại_trong_khoảng"]={
		[1]={{1,10},{20,220}},
		[3]={{1,10},{20,220}}
	},
}

SKILL["cuiyan120"] = {
	["tên_kỹ_năng"] = "Ngự Tuyết Ẩn",
	["tiêu_hao_nội_lực"]={{{1,35},{20,80},{21,80}}},
	["thời_gian_hồi_chiêu"]={{{1,60*18},{15,45*18},{20,40*18},{21,40*18}}},
	["thời_gian_hồi_chiêu_trên_ngựa"]={{{1,60*18},{15,45*18},{20,40*18},{21,40*18}}},
	["ẩn_thân_tạm_thời"]={{{1,1},{20,1}},{{1,5*18},{15,25*18},{20,30*18},{21,30*18}}},
	["tổng_kinh_nghiệm_lên_cấp"]=
	{{
		{1,178512},
		{2,194876},
		{3,227603},
		{4,276694},
		{5,342148},
		{6,423966},
		{7,522148},
		{8,636694},
		{9,767603},
		{10,914876},
		{11,1078512},
		{12,1356694},
		{13,1749421},
		{14,2256694},
		{15,2744181},
		{16,3446181},
		{17,4257381},
		{18,5177781},
		{19,6207381},
		{20,6207381},
	}},	
}
